/*
 Navicat Premium Data Transfer

 Source Server         : root
 Source Server Type    : MySQL
 Source Server Version : 80033
 Source Host           : localhost:3306
 Source Schema         : infor
 Target Server Type    : MySQL
 Target Server Version : 80033
 File Encoding         : 65001

 Date: 22/08/2023 18:30:12
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for 毕业论文
-- ----------------------------
DROP TABLE IF EXISTS `毕业论文`;
CREATE TABLE `毕业论文`  (
  `姓名` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `学号` int(0) NOT NULL,
  `学院` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `专业` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `专业号` int(0) NULL DEFAULT NULL,
  `年级` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `毕业论文题目` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `毕业论文成绩` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `毕业论文指导老师` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  PRIMARY KEY (`学号`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of 毕业论文
-- ----------------------------
INSERT INTO `毕业论文` VALUES ('高迈', 2016211107, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '', '', '');
INSERT INTO `毕业论文` VALUES ('陈红朱', 2017210379, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '在线协作学习中学习者协作问题解决能力分析及与学习成绩的关系研究', '良好', '张思');
INSERT INTO `毕业论文` VALUES ('杨炳娜', 2017212664, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '基于Niagara组件的UE实时可交互流体模型优化及实践', '良好', '王志锋');
INSERT INTO `毕业论文` VALUES ('甘胤力', 2017212915, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '基于hexo平台的个人博客网站的设计与搭建', '良好', '夏丹');
INSERT INTO `毕业论文` VALUES ('杨文蝶', 2017213264, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '教学视频中字幕类型对不同民族学生的学习效果和学习体验的影响研究', '优秀', '杨九民');
INSERT INTO `毕业论文` VALUES ('欧鑫佳', 2017215500, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '基于习题表征和学生表征的知识追踪方法研究', '优秀', '黄涛');
INSERT INTO `毕业论文` VALUES ('王慧', 2018212342, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '“思维导图”教学应用的案例研究', '良好', '刘清堂');
INSERT INTO `毕业论文` VALUES ('吴远扬', 2018212343, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '智能家居主题的steam课程设计与开发', '良好', '庞世燕');
INSERT INTO `毕业论文` VALUES ('郭冰倩', 2018212344, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '基于Moodle 平台的协作学习设计与应用研究--以高中信息技术课堂为例', '良好', '刘丹');
INSERT INTO `毕业论文` VALUES ('黄露', 2018212345, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '信息技术课堂提问技能实录分析与训练案例的设计开发', '良好', '蒋玲');
INSERT INTO `毕业论文` VALUES ('朱雪莉', 2018212347, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '职前中小学教师在教学中使用信息技术的影响因素分析', '良好', '罗恒');
INSERT INTO `毕业论文` VALUES ('侯沛露', 2018212349, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '基于Moodle平台的协作学习应用研究——以高中英语语法课为例', '良好', '刘丹');
INSERT INTO `毕业论文` VALUES ('文璋', 2018212350, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '大学生在线学习能力调查分析一以华中师范大学为例', '良好', '王贵才');
INSERT INTO `毕业论文` VALUES ('杨天甜', 2018212351, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '教育技术学CSSCI来源期刊的引文研究与分析', '良好', '刘丹');
INSERT INTO `毕业论文` VALUES ('程欣艳', 2018212352, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '交互式教学视频中嵌入问题是否开卷和学习者成就动机对学习的影响', '良好', '杨九民');
INSERT INTO `毕业论文` VALUES ('杨鑫林', 2018212354, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '师范生信息化教学能力需求的差异性分析——基于学习反馈单的认知网络分析', '良好', '刘清堂');
INSERT INTO `毕业论文` VALUES ('陈琛', 2018212355, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '基于课程标准的中学人工智能课程微课资源的设计与开发——以“无人驾驶”课程为例', '良好', '周平红');
INSERT INTO `毕业论文` VALUES ('杨海', 2018212356, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '高中课堂教学中的师生互动研究', '良好', '彭文辉');
INSERT INTO `毕业论文` VALUES ('苏文英', 2018212357, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '小学人工智能课程微课资源的设计与开发——以“AI在变形工坊”为例', '优秀', '邓伟');
INSERT INTO `毕业论文` VALUES ('崔佳睿', 2018212358, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '高中信息技术算法类教学课堂的案例分析', '良好', '蒋玲');
INSERT INTO `毕业论文` VALUES ('蒋珂', 2018212359, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '分享式PowerPoint演示文稿自动生成功能的设计与开发', '良好', '黄磊');
INSERT INTO `毕业论文` VALUES ('唐佳宇', 2018212360, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '基于微课的翻转课堂在实验教学中的应用研究——以高中信息技术课程为例', '良好', '王贵才');
INSERT INTO `毕业论文` VALUES ('邓樊博文', 2018212361, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '教师元认知策略支持对在线学习者赋能的影响研究——基于结构方程模型的数据分析研究', '良好', '杨玉芹');
INSERT INTO `毕业论文` VALUES ('石越文', 2018212362, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '嵌入问题的类型和出现形式对视频学习的研究', '良好', '杨九民');
INSERT INTO `毕业论文` VALUES ('李锐祺', 2018212364, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '基于STEAM教育理念的小学信息技术课程设计与实践研究', '良好', '罗恒');
INSERT INTO `毕业论文` VALUES ('阿热孜古丽·麦麦提', 2018212365, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '思维导图在高中信息技术课程教学中的应用', '良好', '王轩');
INSERT INTO `毕业论文` VALUES ('迪丽娜尔·麦麦提敏', 2018212366, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '高中信息技术课程探究式教学模式应用研究', '良好', '彭文辉');
INSERT INTO `毕业论文` VALUES ('陈子祺', 2018212367, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '跨学科项目式学习教学案例开发-以《制作年历》为例', '中等', '李文昊');
INSERT INTO `毕业论文` VALUES ('徐晓东', 2018212368, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '课堂教学行为统计与分析', '中等', '邓伟');
INSERT INTO `毕业论文` VALUES ('代虹飞', 2018212384, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '疫情背景下高校教师在线教学中的角色研究', '良好', '刘丹');
INSERT INTO `毕业论文` VALUES ('肖遥', 2018212385, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '初中人工智能课程微课资源的设计与开发——以《智能采摘》为例', '优秀', '周平红');
INSERT INTO `毕业论文` VALUES ('屈芳颖', 2018212386, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '在线学习中同伴评价对学习者批判性思维的影响', '良好', '周平红');
INSERT INTO `毕业论文` VALUES ('李兆洁', 2018212387, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '教学技能训练评价工具的设计与开发——以华中师范大学信息技术课程为例', '良好', '蒋玲');
INSERT INTO `毕业论文` VALUES ('刘昭辰', 2018212388, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '基于注意力的学生类型分类方法研究', '良好', '魏艳涛');
INSERT INTO `毕业论文` VALUES ('刘洁', 2018212389, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '大学生在线学习动机的影响因素探究——整合探究社区理论与自我调节学习视角', '良好', '罗恒');
INSERT INTO `毕业论文` VALUES ('钟婷', 2018212390, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '基于小雅平台的在线课堂学习体验研究', '中等', '陈迪');
INSERT INTO `毕业论文` VALUES ('姜涛', 2018212391, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '学校教室调度算法设计与分析', '良好', '童名文');
INSERT INTO `毕业论文` VALUES ('陈守萍', 2018212392, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '英语单词APP对大学生英语词汇学习的对比分析——以“百词斩”、“扇贝”、“不背单词”为例', '良好', '彭文辉');
INSERT INTO `毕业论文` VALUES ('周子杰', 2018212393, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '基于LUCENE的垂直搜索引擎的设计与实现——以旅游为主题', '良好', '刘丹');
INSERT INTO `毕业论文` VALUES ('庞清', 2018212394, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '概念图在高中信息技术课程教学中的应用', '良好', '王轩');
INSERT INTO `毕业论文` VALUES ('王佩煜', 2018212395, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '高校教师在线教学倾向的影响因素探究', '良好', '罗恒');
INSERT INTO `毕业论文` VALUES ('陈天娇', 2018212396, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '混合式学习环境下技术接受度对学习满意度的影响机制研究-序列中介模型', '优秀', '罗恒');
INSERT INTO `毕业论文` VALUES ('沈可心', 2018212397, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '基于联通主义学习理论的协同知识建构平台的设计与实现', '良好', '吴林静');
INSERT INTO `毕业论文` VALUES ('李青梅', 2018212398, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '混合式教学模式对高中生编程学习的影响——以python课程为例', '良好', '王贵才');
INSERT INTO `毕业论文` VALUES ('汪洋', 2018212399, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '基于微信小程序的校园学习系统的设计和开发', '良好', '王轩');
INSERT INTO `毕业论文` VALUES ('刘瑾瑾', 2018212400, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '基于教学言语行为的课堂重构', '良好', '邓伟');
INSERT INTO `毕业论文` VALUES ('陈洁盈', 2018212401, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '在线协作学习中学习者会话数据情感智能分析与可视化', '良好', '张思');
INSERT INTO `毕业论文` VALUES ('程宇', 2018212402, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '网络直播及其对在线教育的启示和影响', '良好', '彭文辉');
INSERT INTO `毕业论文` VALUES ('李良亚', 2018212403, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '工程类跨学科项目式学习教学案例开发——以《长江大桥》为例', '良好', '李文昊');
INSERT INTO `毕业论文` VALUES ('黄皓', 2018212404, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '基于STEM课程的项目式教学对小学生批判性思维的影响研究', '优秀', '张屹');
INSERT INTO `毕业论文` VALUES ('叶双', 2018212405, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '基于问题解决能力提升的个性化学习实现研究', '良好', '彭文辉');
INSERT INTO `毕业论文` VALUES ('沈迎凤', 2018212406, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '信息技术课导入方法的课例分析与总结', '中等', '蒋玲');
INSERT INTO `毕业论文` VALUES ('赵宇辰', 2018212407, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '在线学习互动类型、案例及其设计研究', '中等', '陈迪');
INSERT INTO `毕业论文` VALUES ('安莹镒', 2018212408, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '对话型虚拟助教设计与系统研究', '良好', '刘清堂');
INSERT INTO `毕业论文` VALUES ('朱佳琦', 2018212409, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '词典类APP的UI设计研究——以《霍格沃茨词典》为例', '良好', '王翔');
INSERT INTO `毕业论文` VALUES ('毕美琪', 2018212410, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '校园微电影创作探究——以《拥抱》为例', '良好', '范炀');
INSERT INTO `毕业论文` VALUES ('朱菁洋', 2018212411, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '媒体多任务行为对屏幕阅读的影响', '良好', '黄磊');
INSERT INTO `毕业论文` VALUES ('李雨欣', 2018212412, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '促进学习者高阶认知投入提升的协作学习螺旋模型研究', '良好', '吴林静');
INSERT INTO `毕业论文` VALUES ('徐欣悦', 2018212413, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '在线讨论中不同类型引导性支架的应用效果研究', '良好', '罗恒');
INSERT INTO `毕业论文` VALUES ('王雨欣', 2018212414, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '实践教学管理系统设计与实现', '优秀', '童名文');
INSERT INTO `毕业论文` VALUES ('莫濡菲', 2018212415, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '基于共词分析的在线学习课程评论文本的主题挖掘方法研究——以中国大学生MOOC中与教育技术学相关课程为例', '良好', '赵刚');
INSERT INTO `毕业论文` VALUES ('徐安杰', 2018212416, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '配对编程策略对大学生计算思维的影响研究', '良好', '周平红');
INSERT INTO `毕业论文` VALUES ('梅傲雪', 2018212417, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '六顶思考帽对师范生创造力的影响研究', '良好', '龙陶陶');
INSERT INTO `毕业论文` VALUES ('吴佳敏', 2018212418, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '基于虚拟仿真实验平台的项目式学习研究——以高中信息技术课程为例', '良好', '王贵才');
INSERT INTO `毕业论文` VALUES ('吕晓彤', 2018212419, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '在线讨论中学习者调节学习过程与认知深度的协同演化研究', '良好', '吴林静');
INSERT INTO `毕业论文` VALUES ('尹莉娜', 2018212420, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '基于角色扮演的游戏化教学在K-12人工智能教育中的应用研究', '良好', '郑旭东');
INSERT INTO `毕业论文` VALUES ('刘诗睿', 2018212421, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '在线协作学习中师范生TPACK发展轨迹研究', '良好', '张思');
INSERT INTO `毕业论文` VALUES ('朱博', 2018212422, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '跨学科项目式学习教学案例开发-以《京剧脸谱绘画》为例', '中等', '李文昊');
INSERT INTO `毕业论文` VALUES ('侯思冉', 2018212425, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '问题化课堂教学的师生对话行为模式研究', '优秀', '刘清堂');
INSERT INTO `毕业论文` VALUES ('高天娇', 2018212426, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '基于脑电的问题解决能力预测模型研究', '良好', '赵刚');
INSERT INTO `毕业论文` VALUES ('张力丹', 2018212427, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '虚拟现实技术在审美教育中的应用及优化策略分析', '良好', '刘俐利');
INSERT INTO `毕业论文` VALUES ('徐飞龙', 2018212428, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '华中师范大学南湖综合楼内部虚拟三维漫游系统设计与开发：手工建模与非手工建模两种方法', '优秀', '陈加');
INSERT INTO `毕业论文` VALUES ('刘佳乐', 2018212429, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '基于MBE风格的桌游文创产品设计研究——以《MBE风格狼人杀》为例', '良好', '王翔');
INSERT INTO `毕业论文` VALUES ('郑清', 2018212430, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '基于思维导图的学习者认知结构分析', '良好', '刘清堂');
INSERT INTO `毕业论文` VALUES ('蔡逸洋', 2018212431, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '基于作品观察的小学生计算思维能力评价工具研究', '中等', '邓伟');
INSERT INTO `毕业论文` VALUES ('刘佳惠', 2018212432, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '虚拟现实技术对武汉知音文化传播的影响及提升策略', '良好', '庄文杰');
INSERT INTO `毕业论文` VALUES ('钱龙', 2018212433, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '潮流设计风导向的视效教学自媒体研发', '良好', '陈迪');
INSERT INTO `毕业论文` VALUES ('张雯', 2018212434, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '基于Unity3D的校园火灾逃生演练系统的设计与开发', '良好', '田元');
INSERT INTO `毕业论文` VALUES ('杨栩涵', 2018212435, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '基于摄影测量技术的VR场景重建——以华中师范大学南湖教学楼为例', '良好', '陈迪');
INSERT INTO `毕业论文` VALUES ('黄燚', 2018212436, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '以教师交流与课堂分析为主体功能的平台网站的设计与实现', '良好', '陈加');
INSERT INTO `毕业论文` VALUES ('齐可意', 2018212437, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '中小学教师信息素养现状对比分析研究——以c区为例', '良好', '张屹');
INSERT INTO `毕业论文` VALUES ('杨诗涵', 2018212438, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '基于课堂视频的教学言语模式分析与研究', '优秀', '赵刚');
INSERT INTO `毕业论文` VALUES ('黄婕', 2018212439, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '', '', '');
INSERT INTO `毕业论文` VALUES ('谢夏风', 2018212440, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '基于“哔哩哔哩”网站的用户画像研究——以思政内容的大学生群体用户为例', '优秀', '庄文杰');
INSERT INTO `毕业论文` VALUES ('余哲', 2018212441, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '孤独症儿童语言障碍评估干预APP的交互界面设计研究——以“小马爱说话”为例', '良好', '刘俐利');
INSERT INTO `毕业论文` VALUES ('蒲丽娟', 2018212444, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '声音和手势对视频学习的影响研究', '良好', '杨九民');
INSERT INTO `毕业论文` VALUES ('黄楠', 2018212445, '人工智能教育学部', '科学教育_505', 505, '2018', 'STEAM相关学科职前教师科研能力调查研究', '良好', '王世娟');
INSERT INTO `毕业论文` VALUES ('胡汇', 2018212446, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '非遗数字化背景下土家织锦APP的设计与应用研究——以“西兰卡普”为例', '良好', '庄文杰');
INSERT INTO `毕业论文` VALUES ('罗霞', 2018212447, '人工智能教育学部', '科学教育_505', 505, '2018', '中小学教师STEAM教育素养的结构与提升策略研究', '良好', '郑旭东');
INSERT INTO `毕业论文` VALUES ('何堰清', 2018212448, '人工智能教育学部', '科学教育_505', 505, '2018', '面向中小学人工智能教育的景点识别案例设计与开发', '良好', '庞世燕');
INSERT INTO `毕业论文` VALUES ('熊炜', 2018212450, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '同伴反馈程度对学习效果的影响', '中等', '杨九民');
INSERT INTO `毕业论文` VALUES ('王雨欣', 2018212452, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '融媒体环境下在线教学的知识共享网络结构研究——基于社会网络分析法', '良好', '赵肖雄');
INSERT INTO `毕业论文` VALUES ('陈明凤', 2018212454, '人工智能教育学部', '科学教育_505', 505, '2018', '基于社会建构理论的角色扮演之游戏化教学案例设计', '良好', '郑旭东');
INSERT INTO `毕业论文` VALUES ('汤昊程', 2018212455, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '小学生自我效能感与手机游戏行为的关系', '良好', '黄磊');
INSERT INTO `毕业论文` VALUES ('李婷婷', 2018212456, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '沉浸式虚拟环境对大学生学习投入度影响的实证研究', '良好', '陈加');
INSERT INTO `毕业论文` VALUES ('张晓瑜', 2018212457, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '华中师范大学南门区域三维漫游系统的设计与开发', '良好', '陈加');
INSERT INTO `毕业论文` VALUES ('邱璐莹', 2018212458, '人工智能教育学部', '科学教育_505', 505, '2018', '基于知识整合教学理论的职前科学教师探究式教学设计课程设计与开发', '良好', '龙陶陶');
INSERT INTO `毕业论文` VALUES ('刘冰心', 2018212461, '人工智能教育学部', '科学教育_505', 505, '2018', '面向场馆学习的游戏化探究式学习模式设计', '优秀', '李秀晗');
INSERT INTO `毕业论文` VALUES ('赵涵', 2018212462, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '中小学教师跨学科教学能力评价研究', '良好', '周平红');
INSERT INTO `毕业论文` VALUES ('阳卓君', 2018212464, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '在线协作学习活动设计策略与应用研究——以《现代教育技术应用》课程为例', '良好', '王忠华');
INSERT INTO `毕业论文` VALUES ('曹文君', 2018212465, '人工智能教育学部', '科学教育_505', 505, '2018', '基于探究式学习的中小学科学校本课程的设计与开发', '良好', '龙陶陶');
INSERT INTO `毕业论文` VALUES ('侯兆鑫', 2018212466, '人工智能教育学部', '教育技术学（非师范）_508', 508, '2018', '机器人课程中虚实融合教学培养小学生计算思维的研究', '良好', '张屹');
INSERT INTO `毕业论文` VALUES ('许思诺', 2018212467, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '微视频在高中信息技术课程教学中的应用调查分析-以云南省昆明市为例', '良好', '王贵才');
INSERT INTO `毕业论文` VALUES ('郝明霞', 2018212468, '人工智能教育学部', '科学教育_505', 505, '2018', '论证驱动型探究活动中职前科学教师的口头论证能力分析与发展轨迹研究', '良好', '龙陶陶');
INSERT INTO `毕业论文` VALUES ('阳思雨', 2018212469, '人工智能教育学部', '科学教育_505', 505, '2018', '基于学习分析的自我反思性评价培养大学生协作探究能力的效果研究', '优秀', '杨玉芹');
INSERT INTO `毕业论文` VALUES ('张营', 2018212472, '人工智能教育学部', '科学教育_505', 505, '2018', '面向中小学人工智能教育的课程设计与开发——以垃圾分类为例', '良好', '庞世燕');
INSERT INTO `毕业论文` VALUES ('郑康', 2018212473, '人工智能教育学部', '科学教育_505', 505, '2018', '基于目标检测算法的学生课堂行为分析', '良好', '庞世燕');
INSERT INTO `毕业论文` VALUES ('黄涵', 2018212474, '人工智能教育学部', '科学教育_505', 505, '2018', '六顶思考帽促进师范生在线协作学习过程中的角色分析', '良好', '龙陶陶');
INSERT INTO `毕业论文` VALUES ('肖菁婧', 2018212475, '人工智能教育学部', '科学教育_505', 505, '2018', '面向卫星遥感技术的steam课程设计', '优秀', '陈迪');
INSERT INTO `毕业论文` VALUES ('喻星星', 2018212476, '人工智能教育学部', '科学教育_505', 505, '2018', '论证驱动型探究活动的设计与应用研究', '良好', '龙陶陶');
INSERT INTO `毕业论文` VALUES ('张宇轩', 2018212499, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '基于用户体验的儿童心理健康智能分析系统APP界面设计研究', '良好', '刘俐利');
INSERT INTO `毕业论文` VALUES ('李乐潇', 2018212500, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '全景图像拼接及其关键步骤图像配准算法研究', '良好', '陈加');
INSERT INTO `毕业论文` VALUES ('林劲宏', 2018212501, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '艺术摄影中情绪障碍的视觉呈现研究——以作品《眼》、《离群》为例', '良好', '王翔');
INSERT INTO `毕业论文` VALUES ('程煌惠', 2018212502, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '动画短视频课程资源开发——以家庭中微信使用的代际数字鸿沟为例', '良好', '范炀');
INSERT INTO `毕业论文` VALUES ('何春蓉', 2018212503, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '动画短视频课程资源开发——以《打破刻板印象，从曹操开始》为例', '良好', '范炀');
INSERT INTO `毕业论文` VALUES ('何静', 2018212504, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '导航与问题生成方式对视频学习的交互影响研究', '良好', '杨九民');
INSERT INTO `毕业论文` VALUES ('侯汶君', 2018212505, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '动态信息可视化设计在信息展示中的应用--以作品《模拟联合国流程图》为例', '良好', '王翔');
INSERT INTO `毕业论文` VALUES ('梁剑豪', 2018212506, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '融媒体环境下高校直播课堂教师教学研究', '优秀', '赵肖雄');
INSERT INTO `毕业论文` VALUES ('王雨欣', 2018212507, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '基于小雅平台的智慧化教学实践与创新研究——以《编导基础》课堂为例', '良好', '赵肖雄');
INSERT INTO `毕业论文` VALUES ('邹丽超', 2018212508, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '三维模型三角网格简化软件的研发', '良好', '陈加');
INSERT INTO `毕业论文` VALUES ('程千千', 2018212509, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '基于信息可视化设计的户外运动科普海报制作研究——以海报《走进SRT》为例', '良好', '王翔');
INSERT INTO `毕业论文` VALUES ('覃洁', 2018212510, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '基于Spring Boot的校园交流分享网站的设计与开发', '良好', '夏丹');
INSERT INTO `毕业论文` VALUES ('贺文轩', 2018212511, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '基于迪士尼动画法则的“三渲二”动画制作与研究 ——以短片《日常》为例', '良好', '谭政');
INSERT INTO `毕业论文` VALUES ('郑文彬', 2018212512, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '创客与项目式学习融合在中小学信息技术课堂教学中的应用', '良好', '王轩');
INSERT INTO `毕业论文` VALUES ('郑子澳', 2018212513, '人工智能教育学部', '教育技术学（师范）_507', 507, '2018', '基于Excel的中学信息技术教师功能包开发', '良好', '黄磊');
INSERT INTO `毕业论文` VALUES ('任思萍', 2018212514, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '高光谱图像分类方法研究', '优秀', '魏艳涛');
INSERT INTO `毕业论文` VALUES ('刘章映', 2018212515, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '传播学教学微视频的设计与制作', '良好', '范炀');
INSERT INTO `毕业论文` VALUES ('蔚知衡', 2018212516, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '基于虚幻4引擎的虚拟舞台仿真系统制作', '中等', '夏丹');
INSERT INTO `毕业论文` VALUES ('耿辰羽', 2018212517, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '传统五色理论在本土化游戏美术设计中的应用', '良好', '谭政');
INSERT INTO `毕业论文` VALUES ('陆子欣', 2018212518, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '融合题目语义的多模态知识追踪方法及系统研究', '优秀', '王志锋');
INSERT INTO `毕业论文` VALUES ('马莹', 2018212519, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '《个人笔记》特色网站设计与制作', '良好', '陈加');
INSERT INTO `毕业论文` VALUES ('陈皓东', 2018212520, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '基于Shader的蒸汽朋克风格视觉表现与渲染应用——以作品《Steam City》为例', '优秀', '谭政');
INSERT INTO `毕业论文` VALUES ('周冀立', 2018212521, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '人工智能美学视域下数字图形设计与情感表达——以展览“或然世界”为例', '良好', '谭政');
INSERT INTO `毕业论文` VALUES ('张艳萍', 2018212522, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '“自媒体”场域下教育类短视频的知识传播与共享机制研究——以B站为例', '良好', '赵肖雄');
INSERT INTO `毕业论文` VALUES ('刘雨桐', 2018212524, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '知识类短视频的叙事策略与传播效果研究——以B站UP主“画渣花小烙”“丁香医生”为例', '良好', '赵肖雄');
INSERT INTO `毕业论文` VALUES ('郭怡欣', 2018212526, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '应急救援的信息可视化研究——以实验室突发安全事故应急预案为例', '优秀', '王翔');
INSERT INTO `毕业论文` VALUES ('潘梦鸽', 2018212527, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '基于Bootstrap的校园二手交易信息网站设计与制作', '良好', '陈加');
INSERT INTO `毕业论文` VALUES ('邓妍', 2018212528, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '国产动画电影对传统文化的改编模式研究及案例分析', '良好', '陈迪');
INSERT INTO `毕业论文` VALUES ('王思萍', 2018212530, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '基于WebGL和HTML5的太阳系虚拟仿真教学系统的设计与实现', '优秀', '闵秋莎');
INSERT INTO `毕业论文` VALUES ('李汇之', 2018212531, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '真实观视域下的VR纪录片视听语言创新性研究', '优秀', '范炀');
INSERT INTO `毕业论文` VALUES ('黄兆琦', 2018212532, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '短视频对国风融合作品传播的影响及提升策略——以国风街舞为例', '中等', '庄文杰');
INSERT INTO `毕业论文` VALUES ('王祯妮', 2018212533, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '基于WAMP架构的流浪猫咪救助网站的设计与实现', '良好', '夏丹');
INSERT INTO `毕业论文` VALUES ('任彬', 2018212534, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '轻剧情短视频创作探究—以抖音账号“虎皮卷和菠萝包”为例', '良好', '欧阳泓杰');
INSERT INTO `毕业论文` VALUES ('钟英', 2018212535, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '非遗短视频在抖音平台的传播及提升策略——以海南黎族织锦为例', '中等', '庄文杰');
INSERT INTO `毕业论文` VALUES ('梁丝漪', 2018212536, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '基于增强现实技术的科普教育展项的设计与实现——以越王勾践剑为例', '良好', '王志锋');
INSERT INTO `毕业论文` VALUES ('李紫琦', 2018212537, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '动画短视频教学资源开发--唐朝诗词的古今传播', '良好', '范炀');
INSERT INTO `毕业论文` VALUES ('王成诚', 2018212538, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '基于深度学习的行人重识别方法研究', '良好', '王志锋');
INSERT INTO `毕业论文` VALUES ('徐卓然', 2018212539, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '基于知识结构和协同过滤的多目标试题推荐方法', '良好', '黄涛');
INSERT INTO `毕业论文` VALUES ('雷雨龙', 2018214650, '人工智能教育学部', '数字媒体技术_506', 506, '2018', '“泛知识”类短视频创作探究与实践 ——以“台湾电影新浪潮三杰”为例', '良好', '欧阳泓杰');
INSERT INTO `毕业论文` VALUES ('周思雨', 2018214703, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '基于自监督学习的儿童三维人脸重建', '优秀', '刘乐元');
INSERT INTO `毕业论文` VALUES ('毛懋', 2018214863, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '基于深度学习的偏振双目立体几何方法研究', '优秀', '周东波');
INSERT INTO `毕业论文` VALUES ('谯磊', 2018215218, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '基于物联网的智慧教室环境数据采集系统', '良好', '戴志诚');
INSERT INTO `毕业论文` VALUES ('徐雪碧', 2018215326, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '基于BTM发现论文关联关系方法研究', '优秀', '余新国');
INSERT INTO `毕业论文` VALUES ('肖子琦', 2018215327, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '智慧教室点云自动分类方法研究', '良好', '周东波');
INSERT INTO `毕业论文` VALUES ('陈斐', 2018215328, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '虚拟教师的脸部美学分析', '良好', '钟正');
INSERT INTO `毕业论文` VALUES ('苟璇如', 2018215329, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '教师课堂目光运用对比研究', '良好', '陈增照');
INSERT INTO `毕业论文` VALUES ('夏勇正', 2018215330, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '智能学伴对话系统及其关键技术——以初中知识点问答为例', '良好', '刘智');
INSERT INTO `毕业论文` VALUES ('刘怡文', 2018215331, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '小学数学文字题解答呈现方式研究', '良好', '余新国');
INSERT INTO `毕业论文` VALUES ('李冰冰', 2018215332, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '基于三维儿童人脸重建的人物模型生成技术', '良好', '刘乐元');
INSERT INTO `毕业论文` VALUES ('温龙超', 2018215334, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '课堂教学师生话语互动的机器理解与分析', '良好', '廖盛斌');
INSERT INTO `毕业论文` VALUES ('高玉乾', 2018215335, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '基于在线学习行为数据的学习者学习模式分析', '优秀', '卢春');
INSERT INTO `毕业论文` VALUES ('黄温瑞', 2018215336, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '小学数学应用题自动批改系统的设计和实现', '良好', '张婷');
INSERT INTO `毕业论文` VALUES ('陈聪', 2018215337, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '基于关联规则的在线学习平台教师行为对学习者行为影响研究', '良好', '卢春');
INSERT INTO `毕业论文` VALUES ('梁志宇', 2018215338, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '在线课程推荐系统设计与开发', '良好', '陈矛');
INSERT INTO `毕业论文` VALUES ('刘兆辰', 2018215339, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '基于Avatar游戏的儿童孤独症干预系统', '良好', '刘乐元');
INSERT INTO `毕业论文` VALUES ('韩邵杭', 2018215340, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', 'transformer框架下的图像与视频描述生成研究', '良好', '彭世新');
INSERT INTO `毕业论文` VALUES ('党倬政', 2018215341, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '多源数据中的跨模态情感识别与分析', '良好', '彭世新');
INSERT INTO `毕业论文` VALUES ('陈佳敏', 2018215342, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '语言情感分析及其在课堂上的应用', '优秀', '陈增照');
INSERT INTO `毕业论文` VALUES ('孙志攀', 2018215343, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '三维虚拟环境下教师手势识别与交互系统设计与实现', '良好', '吴珂');
INSERT INTO `毕业论文` VALUES ('刘益宁', 2018215344, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '基于深度神经网络的学习者姿态估计方法及应用研究', '良好', '刘海');
INSERT INTO `毕业论文` VALUES ('屈俊杰', 2018215345, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '基于BP神经网络的智慧教室舒适度评价', '良好', '戴志诚');
INSERT INTO `毕业论文` VALUES ('王泽楷', 2018215346, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '基于深度学习的学生评价的文本分析研究', '良好', '陈增照');
INSERT INTO `毕业论文` VALUES ('罗超洋', 2018215347, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '基于MOOC课程评论的学习认知型情绪识别研究', '良好', '刘智');
INSERT INTO `毕业论文` VALUES ('屈仁弟', 2018215348, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '基于改进Felder-Silverman模型的学习风格聚类与学生成绩预测', '良好', '赵亮');
INSERT INTO `毕业论文` VALUES ('徐晨曦', 2018215349, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '数据驱动的篮球出场效率评价研究', '良好', '黄涛');
INSERT INTO `毕业论文` VALUES ('胡典', 2018215350, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '小学人工智能课程教学模式比较分析', '良好', '卢春');
INSERT INTO `毕业论文` VALUES ('胡昕曈', 2018215351, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '基于生成对抗网络的动漫图片风格迁移技术研究', '良好', '孙建文');
INSERT INTO `毕业论文` VALUES ('谢俊', 2018215352, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '基于CWT时频图和CNN预训练模型的心率估计研究', '良好', '赵亮');
INSERT INTO `毕业论文` VALUES ('尹娜', 2018215353, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '基于时序数据的神经网络心率估计方法研究', '良好', '赵亮');
INSERT INTO `毕业论文` VALUES ('冯锦天', 2018215354, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '面向高等数学的知识图谱自动构建技术研究', '优秀', '孙建文');
INSERT INTO `毕业论文` VALUES ('陈胜男', 2018215356, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '基于视觉感知的数感问题自动生成系统设计与实现', '良好', '何彬');
INSERT INTO `毕业论文` VALUES ('贺文倩', 2018215357, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '学科知识的地图化表达及其教学资源管理方法', '良好', '周东波');
INSERT INTO `毕业论文` VALUES ('奚美娟', 2018215358, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '孤独症儿童面部表情识别与表达干预训练系统', '良好', '张坤');
INSERT INTO `毕业论文` VALUES ('刘一泓', 2018215359, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '基于地图映射的学科知识地图生成方法研究', '良好', '周东波');
INSERT INTO `毕业论文` VALUES ('张笑典', 2018215360, '人工智能教育学部', '数据科学与大数据技术_504', 504, '2018', '数据驱动的美育测评研究', '良好', '黄涛');

-- ----------------------------
-- Table structure for 本科实习
-- ----------------------------
DROP TABLE IF EXISTS `本科实习`;
CREATE TABLE `本科实习`  (
  `姓名` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `学号` int(0) NULL DEFAULT NULL,
  `专业` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `年级` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `学部内实习指导教师` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of 本科实习
-- ----------------------------
INSERT INTO `本科实习` VALUES ('翁逸达', 2018212423, '教育技术学（非师范）_508', '2019', '/');
INSERT INTO `本科实习` VALUES ('宋宁宁', 2019213420, '教育技术学（非师范）_508', '2019', '罗恒');
INSERT INTO `本科实习` VALUES ('李清雅', 2019213421, '教育技术学（非师范）_508', '2019', '吴林静');
INSERT INTO `本科实习` VALUES ('王晶', 2019213422, '教育技术学（非师范）_508', '2019', '罗恒');
INSERT INTO `本科实习` VALUES ('王安淇', 2019213423, '教育技术学（非师范）_508', '2019', '刘清堂');
INSERT INTO `本科实习` VALUES ('杨嘉欣', 2019213424, '教育技术学（非师范）_508', '2019', '罗恒');
INSERT INTO `本科实习` VALUES ('叶海晴', 2019213425, '教育技术学（非师范）_508', '2019', '魏艳涛');
INSERT INTO `本科实习` VALUES ('张晶', 2019213426, '教育技术学（非师范）_508', '2019', '吴林静');
INSERT INTO `本科实习` VALUES ('陈莹', 2019213429, '教育技术学（非师范）_508', '2019', '李秀晗');
INSERT INTO `本科实习` VALUES ('陈瞻', 2019213430, '教育技术学（非师范）_508', '2019', '李秀晗');
INSERT INTO `本科实习` VALUES ('伍庆', 2019213431, '教育技术学（非师范）_508', '2019', '罗恒');
INSERT INTO `本科实习` VALUES ('程炜瑶', 2019213432, '教育技术学（非师范）_508', '2019', '吴林静');
INSERT INTO `本科实习` VALUES ('韦玉炜', 2019213433, '教育技术学（非师范）_508', '2019', '童名文');
INSERT INTO `本科实习` VALUES ('兰雪尹', 2019213434, '教育技术学（非师范）_508', '2019', '左明章');
INSERT INTO `本科实习` VALUES ('鹿爽', 2019213435, '教育技术学（非师范）_508', '2019', '张思');
INSERT INTO `本科实习` VALUES ('黄赏', 2019213436, '教育技术学（非师范）_508', '2019', '吴林静');
INSERT INTO `本科实习` VALUES ('崔晓龙', 2019213437, '教育技术学（非师范）_508', '2019', '罗恒');
INSERT INTO `本科实习` VALUES ('刘梦纯', 2019213439, '教育技术学（非师范）_508', '2019', '李秀晗');
INSERT INTO `本科实习` VALUES ('郑雪织', 2019213440, '教育技术学（非师范）_508', '2019', '王忠华');
INSERT INTO `本科实习` VALUES ('李颖', 2019213441, '教育技术学（非师范）_508', '2019', '李秀晗');
INSERT INTO `本科实习` VALUES ('尹圆圆', 2019213442, '教育技术学（非师范）_508', '2019', '王忠华');
INSERT INTO `本科实习` VALUES ('李雅洁', 2019213443, '教育技术学（非师范）_508', '2019', '罗恒');
INSERT INTO `本科实习` VALUES ('蒋慧婷', 2019213444, '教育技术学（非师范）_508', '2019', '罗恒');
INSERT INTO `本科实习` VALUES ('朱雪扬', 2019213445, '教育技术学（非师范）_508', '2019', '魏艳涛');
INSERT INTO `本科实习` VALUES ('胡云杰', 2019213446, '教育技术学（非师范）_508', '2019', '罗恒');
INSERT INTO `本科实习` VALUES ('冯丽瑾', 2019213448, '教育技术学（非师范）_508', '2019', '李文昊');
INSERT INTO `本科实习` VALUES ('余梓贤', 2019213449, '教育技术学（非师范）_508', '2019', '刘清堂');
INSERT INTO `本科实习` VALUES ('王婧然', 2019213450, '教育技术学（非师范）_508', '2019', '杨九民');
INSERT INTO `本科实习` VALUES ('张漩', 2019213451, '教育技术学（非师范）_508', '2019', '/');
INSERT INTO `本科实习` VALUES ('周志成', 2019213453, '教育技术学（非师范）_508', '2019', '肖克江');
INSERT INTO `本科实习` VALUES ('尹馨', 2019213454, '教育技术学（非师范）_508', '2019', '罗恒');
INSERT INTO `本科实习` VALUES ('邓雨欣', 2019213455, '教育技术学（非师范）_508', '2019', '张思');
INSERT INTO `本科实习` VALUES ('孔月', 2019213521, '教育技术学（非师范）_508', '2019', '李秀晗');
INSERT INTO `本科实习` VALUES ('张晖', 2019213527, '教育技术学（非师范）_508', '2019', '杨玉芹');
INSERT INTO `本科实习` VALUES ('张芬', 2019213528, '教育技术学（非师范）_508', '2019', '李秀晗');
INSERT INTO `本科实习` VALUES ('钟佳杏', 2019213350, '教育技术学（师范）_507', '2019', '蒋玲');
INSERT INTO `本科实习` VALUES ('丁璐瑶', 2019213352, '教育技术学（师范）_507', '2019', '黄磊');
INSERT INTO `本科实习` VALUES ('李安琪', 2019213354, '教育技术学（师范）_507', '2019', '黄磊');
INSERT INTO `本科实习` VALUES ('刘铭哲', 2019213356, '教育技术学（师范）_507', '2019', '黄磊');
INSERT INTO `本科实习` VALUES ('刘涛', 2019213358, '教育技术学（师范）_507', '2019', '杨琳');
INSERT INTO `本科实习` VALUES ('张媛', 2019213359, '教育技术学（师范）_507', '2019', '杨琳');
INSERT INTO `本科实习` VALUES ('张婷玉', 2019213360, '教育技术学（师范）_507', '2019', '杨琳');
INSERT INTO `本科实习` VALUES ('齐佩骥', 2019213361, '教育技术学（师范）_507', '2019', '杨琳');
INSERT INTO `本科实习` VALUES ('王钰慧', 2019213362, '教育技术学（师范）_507', '2019', '黄磊');
INSERT INTO `本科实习` VALUES ('张清雅', 2019213363, '教育技术学（师范）_507', '2019', '黄磊');
INSERT INTO `本科实习` VALUES ('王璐', 2019213364, '教育技术学（师范）_507', '2019', '黄磊');
INSERT INTO `本科实习` VALUES ('罗利波', 2019213365, '教育技术学（师范）_507', '2019', '黄磊');
INSERT INTO `本科实习` VALUES ('方籽妍', 2019213366, '教育技术学（师范）_507', '2019', '杨琳');
INSERT INTO `本科实习` VALUES ('龚志成', 2019213367, '教育技术学（师范）_507', '2019', '杨琳');
INSERT INTO `本科实习` VALUES ('李荣融', 2019213368, '教育技术学（师范）_507', '2019', '杨琳');
INSERT INTO `本科实习` VALUES ('刘嘉欣', 2019213369, '教育技术学（师范）_507', '2019', '黄磊');
INSERT INTO `本科实习` VALUES ('高兴愉', 2019213371, '教育技术学（师范）_507', '2019', '蒋玲');
INSERT INTO `本科实习` VALUES ('余执旗', 2019213374, '教育技术学（师范）_507', '2019', '蒋玲');
INSERT INTO `本科实习` VALUES ('郑懿容', 2019213375, '教育技术学（师范）_507', '2019', '蒋玲');
INSERT INTO `本科实习` VALUES ('王涵', 2019213376, '教育技术学（师范）_507', '2019', '蒋玲');
INSERT INTO `本科实习` VALUES ('周玥宏', 2019213377, '教育技术学（师范）_507', '2019', '蒋玲');
INSERT INTO `本科实习` VALUES ('刘婧渝', 2019213378, '教育技术学（师范）_507', '2019', '蒋玲');
INSERT INTO `本科实习` VALUES ('范媛柯', 2019213379, '教育技术学（师范）_507', '2019', '杨琳');
INSERT INTO `本科实习` VALUES ('何昀涛', 2019213380, '教育技术学（师范）_507', '2019', '蒋玲');
INSERT INTO `本科实习` VALUES ('冉应应', 2019213381, '教育技术学（师范）_507', '2019', '王忠华');
INSERT INTO `本科实习` VALUES ('何荣清', 2019213382, '教育技术学（师范）_507', '2019', '王忠华');
INSERT INTO `本科实习` VALUES ('刘思悦', 2019213384, '教育技术学（师范）_507', '2019', '黄磊');
INSERT INTO `本科实习` VALUES ('颜溶', 2019213385, '教育技术学（师范）_507', '2019', '王忠华');
INSERT INTO `本科实习` VALUES ('瞿倩', 2019213386, '教育技术学（师范）_507', '2019', '王忠华');
INSERT INTO `本科实习` VALUES ('王子月', 2019213387, '教育技术学（师范）_507', '2019', '蒋玲');
INSERT INTO `本科实习` VALUES ('李志婷', 2019213388, '教育技术学（师范）_507', '2019', '周平红');
INSERT INTO `本科实习` VALUES ('马国玺', 2019213389, '教育技术学（师范）_507', '2019', '周平红');
INSERT INTO `本科实习` VALUES ('朱慧琳', 2019213390, '教育技术学（师范）_507', '2019', '周平红');
INSERT INTO `本科实习` VALUES ('王瑞云', 2019213391, '教育技术学（师范）_507', '2019', '周平红');
INSERT INTO `本科实习` VALUES ('杨欣怡', 2019213393, '教育技术学（师范）_507', '2019', '王忠华');
INSERT INTO `本科实习` VALUES ('林桂新', 2019213394, '教育技术学（师范）_507', '2019', '王忠华');
INSERT INTO `本科实习` VALUES ('吴璇', 2019213396, '教育技术学（师范）_507', '2019', '周平红');
INSERT INTO `本科实习` VALUES ('郭钰洁', 2019213397, '教育技术学（师范）_507', '2019', '周平红');
INSERT INTO `本科实习` VALUES ('许佳怡', 2019213398, '教育技术学（师范）_507', '2019', '周平红');
INSERT INTO `本科实习` VALUES ('祝莹', 2019213400, '教育技术学（师范）_507', '2019', '杨琳');
INSERT INTO `本科实习` VALUES ('郭雨晨', 2019213401, '教育技术学（师范）_507', '2019', '杨琳');
INSERT INTO `本科实习` VALUES ('徐海涛', 2019213402, '教育技术学（师范）_507', '2019', '蒋玲');
INSERT INTO `本科实习` VALUES ('张菊丽', 2019213403, '教育技术学（师范）_507', '2019', '蒋玲');
INSERT INTO `本科实习` VALUES ('胡碟', 2019213404, '教育技术学（师范）_507', '2019', '蒋玲');
INSERT INTO `本科实习` VALUES ('戴梦珂', 2019213405, '教育技术学（师范）_507', '2019', '周平红');
INSERT INTO `本科实习` VALUES ('赵凯', 2019213406, '教育技术学（师范）_507', '2019', '周平红');
INSERT INTO `本科实习` VALUES ('张耀日', 2019213407, '教育技术学（师范）_507', '2019', '杨琳');
INSERT INTO `本科实习` VALUES ('程染曦', 2019213409, '教育技术学（师范）_507', '2019', '王忠华');
INSERT INTO `本科实习` VALUES ('买买提依明·吐尔逊', 2019213411, '教育技术学（师范）_507', '2019', '杨琳');
INSERT INTO `本科实习` VALUES ('图尔荪古丽·艾海提', 2019213412, '教育技术学（师范）_507', '2019', '王忠华');
INSERT INTO `本科实习` VALUES ('钟悦文', 2019213427, '教育技术学（师范）_507', '2019', '/');
INSERT INTO `本科实习` VALUES ('项承怀', 2019213428, '教育技术学（师范）_507', '2019', '王忠华');
INSERT INTO `本科实习` VALUES ('何佳', 2019213509, '科学教育_505', '2019', '庞世燕');
INSERT INTO `本科实习` VALUES ('白雨欣', 2019213510, '科学教育_505', '2019', '庞世燕');
INSERT INTO `本科实习` VALUES ('马永', 2019213511, '科学教育_505', '2019', '庞世燕');
INSERT INTO `本科实习` VALUES ('樊瑶', 2019213512, '科学教育_505', '2019', '庞世燕');
INSERT INTO `本科实习` VALUES ('余智聪', 2019213514, '科学教育_505', '2019', '庞世燕');
INSERT INTO `本科实习` VALUES ('刘悦', 2019213515, '科学教育_505', '2019', '庞世燕');
INSERT INTO `本科实习` VALUES ('杨雨欣', 2019213516, '科学教育_505', '2019', '龙陶陶');
INSERT INTO `本科实习` VALUES ('陈夏梅', 2019213517, '科学教育_505', '2019', '龙陶陶');
INSERT INTO `本科实习` VALUES ('戴梓涵', 2019213518, '科学教育_505', '2019', '王世娟');
INSERT INTO `本科实习` VALUES ('钟晗', 2019213519, '科学教育_505', '2019', '龙陶陶');
INSERT INTO `本科实习` VALUES ('刘学江', 2019213523, '科学教育_505', '2019', '庞世燕');
INSERT INTO `本科实习` VALUES ('刘佳雨', 2019213524, '科学教育_505', '2019', '龙陶陶');
INSERT INTO `本科实习` VALUES ('闫子晗', 2019213525, '科学教育_505', '2019', '龙陶陶');
INSERT INTO `本科实习` VALUES ('赵雅', 2019213526, '科学教育_505', '2019', '龙陶陶');
INSERT INTO `本科实习` VALUES ('罗文娟', 2019213530, '科学教育_505', '2019', '庞世燕');
INSERT INTO `本科实习` VALUES ('胡晴', 2019213531, '科学教育_505', '2019', '庞世燕');
INSERT INTO `本科实习` VALUES ('王宁', 2019213532, '科学教育_505', '2019', '龙陶陶');
INSERT INTO `本科实习` VALUES ('徐莹', 2019213537, '科学教育_505', '2019', '龙陶陶');
INSERT INTO `本科实习` VALUES ('陈冰洁', 2018211912, '数据科学与大数据技术_504', '2019', '蔡畅');
INSERT INTO `本科实习` VALUES ('张天翼', 2019212490, '数据科学与大数据技术_504', '2019', '张婷');
INSERT INTO `本科实习` VALUES ('吕佳凝', 2019214799, '数据科学与大数据技术_504', '2019', '孙建文');
INSERT INTO `本科实习` VALUES ('郑皓丹', 2019214801, '数据科学与大数据技术_504', '2019', '何彬');
INSERT INTO `本科实习` VALUES ('姚孟奇', 2019214802, '数据科学与大数据技术_504', '2019', '王泰');
INSERT INTO `本科实习` VALUES ('义晓洁', 2019214803, '数据科学与大数据技术_504', '2019', '舒江波');
INSERT INTO `本科实习` VALUES ('傅自勋', 2019214804, '数据科学与大数据技术_504', '2019', '赵亮');
INSERT INTO `本科实习` VALUES ('吴雪冰', 2019214805, '数据科学与大数据技术_504', '2019', '王泰');
INSERT INTO `本科实习` VALUES ('孟镕媛', 2019214806, '数据科学与大数据技术_504', '2019', '曾致中');
INSERT INTO `本科实习` VALUES ('陈明慧', 2019214807, '数据科学与大数据技术_504', '2019', '周东波');
INSERT INTO `本科实习` VALUES ('饶燕姣', 2019214808, '数据科学与大数据技术_504', '2019', '舒江波');
INSERT INTO `本科实习` VALUES ('马萌欣', 2019214809, '数据科学与大数据技术_504', '2019', '粟柱');
INSERT INTO `本科实习` VALUES ('陈佳儿', 2019214810, '数据科学与大数据技术_504', '2019', '刘俐利');
INSERT INTO `本科实习` VALUES ('鲍诚杰', 2019214811, '数据科学与大数据技术_504', '2019', '陈增照');
INSERT INTO `本科实习` VALUES ('吴可馨', 2019214813, '数据科学与大数据技术_504', '2019', '舒江波');
INSERT INTO `本科实习` VALUES ('李方菁', 2019214814, '数据科学与大数据技术_504', '2019', '李睿');
INSERT INTO `本科实习` VALUES ('采蕊涵', 2019214815, '数据科学与大数据技术_504', '2019', '刘乐元');
INSERT INTO `本科实习` VALUES ('张一', 2019214816, '数据科学与大数据技术_504', '2019', '张立山');
INSERT INTO `本科实习` VALUES ('曹宸瑞', 2019214817, '数据科学与大数据技术_504', '2019', '王泰');
INSERT INTO `本科实习` VALUES ('曹阳', 2019214818, '数据科学与大数据技术_504', '2019', '刘俐利');
INSERT INTO `本科实习` VALUES ('邵润琪', 2019214819, '数据科学与大数据技术_504', '2019', '刘乐元');
INSERT INTO `本科实习` VALUES ('刘迪妮', 2019214820, '数据科学与大数据技术_504', '2019', '舒江波');
INSERT INTO `本科实习` VALUES ('徐雨隆', 2019214821, '数据科学与大数据技术_504', '2019', '陈增照');
INSERT INTO `本科实习` VALUES ('江素娟', 2019214822, '数据科学与大数据技术_504', '2019', '周东波');
INSERT INTO `本科实习` VALUES ('李韵远', 2019214824, '数据科学与大数据技术_504', '2019', '陈矛');
INSERT INTO `本科实习` VALUES ('王乐璇', 2019214825, '数据科学与大数据技术_504', '2019', '彭世新');
INSERT INTO `本科实习` VALUES ('郑子路', 2019214826, '数据科学与大数据技术_504', '2019', '陈矛');
INSERT INTO `本科实习` VALUES ('朱俊雅', 2019214827, '数据科学与大数据技术_504', '2019', '黄涛');
INSERT INTO `本科实习` VALUES ('黄维雅', 2019214828, '数据科学与大数据技术_504', '2019', '朱莎');
INSERT INTO `本科实习` VALUES ('张旭', 2019214829, '数据科学与大数据技术_504', '2019', '赵亮');
INSERT INTO `本科实习` VALUES ('张梓萱', 2019214830, '数据科学与大数据技术_504', '2019', '舒江波');
INSERT INTO `本科实习` VALUES ('邱逢瑜', 2019214831, '数据科学与大数据技术_504', '2019', '周东波');
INSERT INTO `本科实习` VALUES ('陈诗怡', 2019214832, '数据科学与大数据技术_504', '2019', '刘俐利');
INSERT INTO `本科实习` VALUES ('王金华', 2019214833, '数据科学与大数据技术_504', '2019', '刘俐利');
INSERT INTO `本科实习` VALUES ('周蔚博', 2019214834, '数据科学与大数据技术_504', '2019', '刘海');
INSERT INTO `本科实习` VALUES ('范思泽', 2019214835, '数据科学与大数据技术_504', '2019', '曾致中');
INSERT INTO `本科实习` VALUES ('赵珊珊', 2018214361, '数字媒体技术_506', '2019', '姚璜');
INSERT INTO `本科实习` VALUES ('李世龙', 2018214470, '数字媒体技术_506', '2019', '刘俐利');
INSERT INTO `本科实习` VALUES ('马桂雨', 2018215114, '数字媒体技术_506', '2019', '宁国勤');
INSERT INTO `本科实习` VALUES ('钟迎迎', 2019213370, '数字媒体技术_506', '2019', '陈迪');
INSERT INTO `本科实习` VALUES ('刘蒨妮', 2019213459, '数字媒体技术_506', '2019', '刘俐利');
INSERT INTO `本科实习` VALUES ('周思田', 2019213460, '数字媒体技术_506', '2019', '董石');
INSERT INTO `本科实习` VALUES ('王文超', 2019213461, '数字媒体技术_506', '2019', '陈加');
INSERT INTO `本科实习` VALUES ('胡诗唯', 2019213462, '数字媒体技术_506', '2019', '赵肖雄');
INSERT INTO `本科实习` VALUES ('陈雅琦', 2019213463, '数字媒体技术_506', '2019', '陈加');
INSERT INTO `本科实习` VALUES ('杜禹吉', 2019213464, '数字媒体技术_506', '2019', '姚璜');
INSERT INTO `本科实习` VALUES ('朱宇晨', 2019213465, '数字媒体技术_506', '2019', '庄文杰');
INSERT INTO `本科实习` VALUES ('叶慧霞', 2019213466, '数字媒体技术_506', '2019', '陈加');
INSERT INTO `本科实习` VALUES ('房雨桐', 2019213467, '数字媒体技术_506', '2019', '刘俐利');
INSERT INTO `本科实习` VALUES ('钟欣浪', 2019213468, '数字媒体技术_506', '2019', '陈加');
INSERT INTO `本科实习` VALUES ('刘康', 2019213469, '数字媒体技术_506', '2019', '范炀');
INSERT INTO `本科实习` VALUES ('施妍玟', 2019213470, '数字媒体技术_506', '2019', '陈加');
INSERT INTO `本科实习` VALUES ('缪禹岐', 2019213471, '数字媒体技术_506', '2019', '董石');
INSERT INTO `本科实习` VALUES ('徐丽梅', 2019213472, '数字媒体技术_506', '2019', '林利');
INSERT INTO `本科实习` VALUES ('许慧婷', 2019213473, '数字媒体技术_506', '2019', '陈迪');
INSERT INTO `本科实习` VALUES ('汤俊搏', 2019213474, '数字媒体技术_506', '2019', '范炀');
INSERT INTO `本科实习` VALUES ('谢纪元', 2019213475, '数字媒体技术_506', '2019', '刘俐利');
INSERT INTO `本科实习` VALUES ('钱宇飞', 2019213476, '数字媒体技术_506', '2019', '田元');
INSERT INTO `本科实习` VALUES ('周雨恬', 2019213477, '数字媒体技术_506', '2019', '夏丹');
INSERT INTO `本科实习` VALUES ('童丁诺', 2019213478, '数字媒体技术_506', '2019', '陈迪');
INSERT INTO `本科实习` VALUES ('斯雨婕', 2019213479, '数字媒体技术_506', '2019', '王志锋');
INSERT INTO `本科实习` VALUES ('李星', 2019213480, '数字媒体技术_506', '2019', '田元');
INSERT INTO `本科实习` VALUES ('张明洋', 2019213481, '数字媒体技术_506', '2019', '王志锋');
INSERT INTO `本科实习` VALUES ('符诗雨', 2019213482, '数字媒体技术_506', '2019', '谭政');
INSERT INTO `本科实习` VALUES ('孟凡瑶', 2019213483, '数字媒体技术_506', '2019', '陈迪');
INSERT INTO `本科实习` VALUES ('王建宇', 2019213484, '数字媒体技术_506', '2019', '谭政');
INSERT INTO `本科实习` VALUES ('陈炎东', 2019213485, '数字媒体技术_506', '2019', '田元');
INSERT INTO `本科实习` VALUES ('戴婧', 2019213486, '数字媒体技术_506', '2019', '陈加');
INSERT INTO `本科实习` VALUES ('张雪扬', 2019213487, '数字媒体技术_506', '2019', '魏艳涛');
INSERT INTO `本科实习` VALUES ('吕远擎', 2019213488, '数字媒体技术_506', '2019', '王志锋');
INSERT INTO `本科实习` VALUES ('鲁红芮', 2019213490, '数字媒体技术_506', '2019', '夏丹');
INSERT INTO `本科实习` VALUES ('雷梦婷', 2019213491, '数字媒体技术_506', '2019', '田元');
INSERT INTO `本科实习` VALUES ('徐晓珂', 2019213492, '数字媒体技术_506', '2019', '董石');
INSERT INTO `本科实习` VALUES ('周乐言', 2019213493, '数字媒体技术_506', '2019', '陈迪');
INSERT INTO `本科实习` VALUES ('张志浩', 2019213494, '数字媒体技术_506', '2019', '田元');
INSERT INTO `本科实习` VALUES ('高斯安', 2019213495, '数字媒体技术_506', '2019', '刘俐利');
INSERT INTO `本科实习` VALUES ('宋可意', 2019213496, '数字媒体技术_506', '2019', '魏艳涛');
INSERT INTO `本科实习` VALUES ('吴佳欣', 2019213497, '数字媒体技术_506', '2019', '姚璜');
INSERT INTO `本科实习` VALUES ('徐欢', 2019213498, '数字媒体技术_506', '2019', '姚璜');
INSERT INTO `本科实习` VALUES ('杜宇通', 2019213520, '数字媒体技术_506', '2019', '谭政');
INSERT INTO `本科实习` VALUES ('王玥珂', 2019213533, '数字媒体技术_506', '2019', '陈加');
INSERT INTO `本科实习` VALUES ('王子瑜', 2019213534, '数字媒体技术_506', '2019', '夏丹');
INSERT INTO `本科实习` VALUES ('郭佳晨', 2019213538, '数字媒体技术_506', '2019', '庄文杰');
INSERT INTO `本科实习` VALUES ('徐涵宇', 2019213616, '数字媒体技术_506', '2019', '田元');
INSERT INTO `本科实习` VALUES ('陆雅馨', 2019214085, '数字媒体技术_506', '2019', '赵肖雄');
INSERT INTO `本科实习` VALUES ('张妍玮', 2019214606, '数字媒体技术_506', '2019', '范炀');


-- ----------------------------
-- Table structure for admin
-- ----------------------------
DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin`  (
  `工号` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `密码` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  PRIMARY KEY (`工号`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of admin
-- ----------------------------
INSERT INTO `admin` VALUES ('2021214163', '123456');

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user`  (
  `username` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `password` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  PRIMARY KEY (`username`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('2021214166', '123456');

-- ----------------------------
-- Table structure for 一流课程
-- ----------------------------
DROP TABLE IF EXISTS `一流课程`;
CREATE TABLE `一流课程`  (
  `课程性质` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `内容` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `负责人` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `工作量分配` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of 一流课程
-- ----------------------------
INSERT INTO `一流课程` VALUES ('一流本科课程', '21年推荐申报国家级课程《教学设计》', '杨九民', '暂不计');
INSERT INTO `一流课程` VALUES ('一流本科课程', '21年推荐申报国家级课程《教学技术与媒体》', '李文昊', '暂不计');
INSERT INTO `一流课程` VALUES ('一流本科课程', '22年推荐申报省级一流课程《互联网思维与数字化自主学习》', '上超望', '上超望130、蒋玲10、张思10');
INSERT INTO `一流课程` VALUES ('一流本科课程', '22年推荐申报省级一流课程《信息素养——中小学教师先修课》', '吴砥', '吴砥75、陈敏75');
INSERT INTO `一流课程` VALUES ('一流虚拟仿真课程', '基于模块化任务驱动的虚拟编钟仿真实验', '王志锋', '王志锋40');


-- ----------------------------
-- Table structure for 一流课程2
-- ----------------------------
DROP TABLE IF EXISTS `一流课程2`;
CREATE TABLE `一流课程2`  (
  `教师姓名` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `工作量` float(255, 2) NULL DEFAULT NULL
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

INSERT INTO `一流课程2` VALUES ('上超望',130);
INSERT INTO `一流课程2` VALUES ('蒋玲',10);

-- ----------------------------
-- Records of 一流课程2
-- ----------------------------

-- ----------------------------
-- Table structure for 公共服务
-- ----------------------------
DROP TABLE IF EXISTS `公共服务`;
CREATE TABLE `公共服务`  (
  `日期` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `内容` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `姓名` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `工作时长` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `课时` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of 公共服务
-- ----------------------------
INSERT INTO `公共服务` VALUES ('2022年', '科学教育（师范）专业人培修订（60）', '郑旭东', NULL, '15');
INSERT INTO `公共服务` VALUES ('2022年', '科学教育（师范）专业人培修订（60）', '庞世燕', NULL, '15');
INSERT INTO `公共服务` VALUES ('2022年', '科学教育（师范）专业人培修订（60）', '王世娟', NULL, '15');
INSERT INTO `公共服务` VALUES ('2022年', '科学教育（师范）专业人培修订（60）', '龙陶陶', NULL, '15');
INSERT INTO `公共服务` VALUES ('2022年', '学部教学指导委员会', '刘清堂', NULL, '40');
INSERT INTO `公共服务` VALUES ('2022年', '学部教学指导委员会', '童名文', NULL, '40');
INSERT INTO `公共服务` VALUES ('2022年', '学部教学指导委员会', '刘三女牙', NULL, '40');
INSERT INTO `公共服务` VALUES ('2022年', '学部教学指导委员会', '杨九民', NULL, '40');
INSERT INTO `公共服务` VALUES ('2022年', '学部教学指导委员会', '余新国', NULL, '40');
INSERT INTO `公共服务` VALUES ('2022年', '学部教学指导委员会', '陈靓影', NULL, '40');
INSERT INTO `公共服务` VALUES ('2022年', '学部教学指导委员会', '吴军其', NULL, '40');
INSERT INTO `公共服务` VALUES ('2022年', '学部教学指导委员会', '罗恒', NULL, '40');
INSERT INTO `公共服务` VALUES ('2022年', '学部教学指导委员会', '陈迪', NULL, '40');
INSERT INTO `公共服务` VALUES ('2022年', '学部教学指导委员会', '郑旭东', NULL, '40');
INSERT INTO `公共服务` VALUES ('2022年', '学部教学指导委员会', '陈增照', NULL, '40');
INSERT INTO `公共服务` VALUES ('2022年', '学部教学指导委员会', '李文昊', NULL, '40');
INSERT INTO `公共服务` VALUES ('2022年', '学部教学指导委员会', '黄涛', NULL, '40');
INSERT INTO `公共服务` VALUES ('2022年', '学部教学指导委员会', '赵肖雄', NULL, '60');
INSERT INTO `公共服务` VALUES ('2022-03-25', '21年学生大创项目结项答辩评委', '童名文', '9：00-10：30', '2');
INSERT INTO `公共服务` VALUES ('2022-03-25', '21年学生大创项目结项答辩评委', '王世娟', '9：00-10：30', '2');
INSERT INTO `公共服务` VALUES ('2022-03-25', '21年学生大创项目结项答辩评委', '姚璜', '9：00-10：30', '2');
INSERT INTO `公共服务` VALUES ('2022-05-06', '20年学院疫期教研项目结项答辩评委', '童名文', '9：00-11：30', '3');
INSERT INTO `公共服务` VALUES ('2022-05-06', '20年学院疫期教研项目结项答辩评委', '张屹', '9：00-11：30', '3');
INSERT INTO `公共服务` VALUES ('2022-05-06', '20年学院疫期教研项目结项答辩评委', '付卫东', '9：00-11：30', '3');
INSERT INTO `公共服务` VALUES ('2022-05-02', '给张屹老师做教学创新课指导', '杨九民', '9：00-10：30', '2');
INSERT INTO `公共服务` VALUES ('2022-05-09', '给张屹老师做教学创新课指导', '杨九民', '9：00-10：30', '2');
INSERT INTO `公共服务` VALUES ('2022-06-11', '四六级监考', '王世娟', '一天', '8');
INSERT INTO `公共服务` VALUES ('2022-06-11', '四六级监考', '罗恒', '一天', '8');
INSERT INTO `公共服务` VALUES ('2022-06-11', '四六级监考', '刘怡', '一天', '8');
INSERT INTO `公共服务` VALUES ('2022-06-11', '四六级监考', '陈加', '一天', '8');
INSERT INTO `公共服务` VALUES ('2022-06-11', '四六级监考', '林利', '一天', '8');
INSERT INTO `公共服务` VALUES ('2022-06-11', '四六级监考', '赵亮', '一天', '8');
INSERT INTO `公共服务` VALUES ('2022-06-11', '四六级监考', '张坤', '一天', '8');
INSERT INTO `公共服务` VALUES ('2022-06-11', '四六级监考', '卢思逸', '一天', '8');
INSERT INTO `公共服务` VALUES ('2022-06-11', '四六级监考', '徐宏敏', '一天', '8');
INSERT INTO `公共服务` VALUES ('2022-05-27', '本科期中教学检查师生座谈会', '罗恒', '10：00 - 11：00', '1');
INSERT INTO `公共服务` VALUES ('2022-05-27', '本科期中教学检查师生座谈会', '陈迪', '10：00 - 11：00', '1');
INSERT INTO `公共服务` VALUES ('2022-05-27', '本科期中教学检查师生座谈会', '王世娟', '10：00 - 11：00', '1');
INSERT INTO `公共服务` VALUES ('2022-05-27', '本科期中教学检查师生座谈会', '陈晓宇', '10：00 - 11：00', '1');
INSERT INTO `公共服务` VALUES ('2022-05-27', '本科期中教学检查师生座谈会', '赵亮', '10：00 - 11：00', '1');
INSERT INTO `公共服务` VALUES ('2022-05-27', '本科期中教学检查师生座谈会', '刘乐元', '10：00 - 11：00', '1');
INSERT INTO `公共服务` VALUES ('2022-09-29', '2022年大创项目中期检查答辩评审', '张坤', '14：20-17：00', '3');
INSERT INTO `公共服务` VALUES ('2022-09-29', '2022年大创项目中期检查答辩评审', '王世娟', '14：20-17：00', '3');
INSERT INTO `公共服务` VALUES ('2022-09-29', '2022年大创项目中期检查答辩评审', '上超望', '14：20-17：00', '3');
INSERT INTO `公共服务` VALUES ('2022-09-29', '2022年大创项目中期检查答辩评审', '陈加', '14：20-17：00', '3');
INSERT INTO `公共服务` VALUES ('2022-09-29', '2022年大创项目中期检查答辩评审', '赵亮', '14：20-17：00', '3');
INSERT INTO `公共服务` VALUES ('2022-11-26', '转专业监考', '魏艳涛', '8：00-10：00', '2');
INSERT INTO `公共服务` VALUES ('2022-11-26', '转专业监考', '汪双', '8：00-10：00', '2');
INSERT INTO `公共服务` VALUES ('2022-12-10', '四六级监考', '陈迪', '半天', '4');
INSERT INTO `公共服务` VALUES ('2022-12-10', '四六级监考', '万子谦', '半天', '4');
INSERT INTO `公共服务` VALUES ('2022-12-10', '四六级监考', '宁国勤', '半天', '4');
INSERT INTO `公共服务` VALUES ('2022-12-10', '四六级监考', '王涛', '半天', '4');
INSERT INTO `公共服务` VALUES ('2022-12-10', '四六级监考', '张坤', '半天', '4');
INSERT INTO `公共服务` VALUES ('2022-11-30', '转专业面试', '童名文', '14：00-18:00', '4');
INSERT INTO `公共服务` VALUES ('2022-11-30', '转专业面试', '罗恒', '14：00-18:00', '4');
INSERT INTO `公共服务` VALUES ('2022-11-30', '转专业面试', '张坤', '14：00-18:00', '4');
INSERT INTO `公共服务` VALUES ('2022-11-30', '转专业面试', '陈迪', '14：00-18:00', '4');
INSERT INTO `公共服务` VALUES ('2022-11-30', '转专业面试', '刘乐元', '14：00-18:00', '4');
INSERT INTO `公共服务` VALUES ('2022-12-15', '2023年大创项目立项答辩评审', '魏艳涛', '半天', '4');
INSERT INTO `公共服务` VALUES ('2022-12-15', '2023年大创项目立项答辩评审', '刘乐元', '半天', '4');
INSERT INTO `公共服务` VALUES ('2022-12-15', '2023年大创项目立项答辩评审', '朱晓亮', '半天', '4');
INSERT INTO `公共服务` VALUES ('2022-12-15', '2023年大创项目立项答辩评审', '陈加', '半天', '4');
INSERT INTO `公共服务` VALUES ('2022-12-15', '2023年大创项目立项答辩评审', '李秀晗', '半天', '4');
INSERT INTO `公共服务` VALUES ('2022-12-15', '2023年大创项目立项答辩评审', '范炀', '半天', '4');
INSERT INTO `公共服务` VALUES ('2022-12-15', '2023年大创项目立项答辩评审', '范炀', '半天', '3');
-- ----------------------------
-- Table structure for 学生科研
-- ----------------------------
DROP TABLE IF EXISTS `学生科研`;
CREATE TABLE `学生科研`  (
  `序号` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `项目名称` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `级别` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `负责人` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `学号` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `项目组总人数` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `指导老师` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `验收结论` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `总工作量` float(255, 2) NULL DEFAULT NULL
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of 学生科研
-- ----------------------------
INSERT INTO `学生科研` VALUES ('1', '影像药草香——基于短视频创作实践的中医药文化新媒体传播路径探析', 'A', '李汇之', '2018212531', '6', '范炀', '合格', 25.00);
INSERT INTO `学生科研` VALUES ('2', '解读孩子的另一种语言—儿童心理画测试系统', 'A', '梁志宇', '2018215338', '8', '刘俐利', '合格', 25.00);
INSERT INTO `学生科研` VALUES ('3', '视频学习领域下学习策略的整合与应用探究', 'A', '王瑞云', '2019213391', '7', '杨九民', '合格', 25.00);
INSERT INTO `学生科研` VALUES ('4', '如何通过课堂学习行为的改进培养学生高效的学习习惯？——基于目标检测算法的课堂行为分析', 'A', '郑康', '2018212473', '6', '庞世燕', '合格', 25.00);
INSERT INTO `学生科研` VALUES ('5', '以环境保护为主题的项目式STEAM小本课程研发——基于武汉市化工区J小学的教育行动研究', 'B', '徐莹', '2019213537', '7', '龙陶陶', '优秀', 20.00);
INSERT INTO `学生科研` VALUES ('6', '基于项目式教学的社团 STEM 课程对小学生批判性思维的影响研究', 'B', '黄皓', '2018212404', '5', '张屹', '合格', 15.00);
INSERT INTO `学生科研` VALUES ('7', '基于增强现实的“八七会议会址”红色教育系统开发与应用', 'B   (红旅)', '刘佳乐', '2018212429', '7', '谭政', '合格', 15.00);
INSERT INTO `学生科研` VALUES ('8', '基于AR红色旅游APP—瑶里陈毅旧居陈列馆设计', 'B   (红旅)', '张明洋', '2019213481', '8', '谭政', '合格', 15.00);

-- ----------------------------
-- Table structure for 学生竞赛
-- ----------------------------
DROP TABLE IF EXISTS `学生竞赛`;
CREATE TABLE `学生竞赛`  (
  `赛事名称` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `作品名称` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `获奖类别` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `获奖等级` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `获奖学生` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `指导教师` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `总工作量` float(255, 2) NULL DEFAULT NULL,
  `获奖年份` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of 学生竞赛
-- ----------------------------
INSERT INTO `学生竞赛` VALUES ('“iTeach”全国大学生数字化教育应用创新大赛', '《今天你运动了吗》', '国家级', '二等奖', '宋林森、龚志成、张雪扬、秦梓雯、李湘', '李秀晗', 10.00, '2021年');
INSERT INTO `学生竞赛` VALUES ('“iTeach”全国大学生数字化教育应用创新大赛', '《狡猾的“伪装者”——初识特洛伊木马病毒》', '国家级', '二等奖', '贾钰婕、王鑫茹、夏然然、方潇', '罗恒', 10.00, '2021年');
INSERT INTO `学生竞赛` VALUES ('“iTeach”全国大学生数字化教育应用创新大赛', '《放射性同位素的应用》', '国家级', '二等奖', '唐佳宇、侯沛露', '王贵才', 10.00, '2021年');
INSERT INTO `学生竞赛` VALUES ('“iTeach”全国大学生数字化教育应用创新大赛', '《为何它当不了“正常”的农药—百草枯》', '国家级', '二等奖', '钟迎迎、郑懿容、王璐', '王忠华', 10.00, '2021年');
INSERT INTO `学生竞赛` VALUES ('“iTeach”全国大学生数字化教育应用创新大赛', '《探索“星辰大海”之“太阳系”》', '国家级', '三等奖', '王乐璇、马萌欣、李韵远', '刘俐利', 5.00, '2021年');
INSERT INTO `学生竞赛` VALUES ('“iTeach”全国大学生数字化教育应用创新大赛', '《口腔王国历险记》', '国家级', '三等奖', '吴映彤、伏思霖、邓宇晗、黄云瑶、时嘉文', '刘俐利', 5.00, '2021年');
INSERT INTO `学生竞赛` VALUES ('“iTeach”全国大学生数字化教育应用创新大赛', '《蛙妈妈寻食小课堂——探寻蛙跳算法的智慧》', '国家级', '三等奖', '杨诗涵、石越文、朱雪莉、张驰', '上超望', 5.00, '2021年');
INSERT INTO `学生竞赛` VALUES ('“iTeach”全国大学生数字化教育应用创新大赛', '《数字地雷中的算法奥秘》', '国家级', '三等奖', '张清雅、王涵、祝莹、丁璐瑶', '杨琳', 5.00, '2021年');
INSERT INTO `学生竞赛` VALUES ('“iTeach”全国大学生数字化教育应用创新大赛', '《数据压缩之霍夫曼编码》', '国家级', '三等奖', '马桂雨、叶海晴、李世龙、陈瞻、朱慧琳', '杨琳', 5.00, '2021年');
INSERT INTO `学生竞赛` VALUES ('“iTeach”全国大学生数字化教育应用创新大赛', '《Where are my coins?》', '国家级', '三等奖', '程染曦', '杨琳', 5.00, '2021年');
INSERT INTO `学生竞赛` VALUES ('“iTeach”全国大学生数字化教育应用创新大赛', '《食物们的奇妙之旅》', '国家级', '一等奖', '兰雪尹、韦玉炜、李雅洁、王婧然、颜溶', '黄磊', 15.00, '2021年');
INSERT INTO `学生竞赛` VALUES ('“iTeach”全国大学生数字化教育应用创新大赛', '《耳机与耳朵的那些事》', '国家级', '一等奖', '张媛、戴梦珂、李荣融、方籽妍', '李文昊', 15.00, '2021年');
INSERT INTO `学生竞赛` VALUES ('“iTeach”全国大学生数字化教育应用创新大赛', '《童社交——自闭症儿童VR游戏过马路》', '国家级', '一等奖', '张高雨、钟阳、黄应涵、吴宛卿、董倩', '刘俐利', 15.00, '2021年');
INSERT INTO `学生竞赛` VALUES ('“iTeach”全国大学生数字化教育应用创新大赛', '《童心童画—儿童焦虑量表与心理画测验系统》', '国家级', '一等奖', '黄新柯、黄欣、邱云豪、秦金涵、邓策渝', '刘俐利', 15.00, '2021年');
INSERT INTO `学生竞赛` VALUES ('“iTeach”全国大学生数字化教育应用创新大赛', '《量体裁衣-初识子网划分》', '国家级', '一等奖', '郭雨晨、周玥宏、钟佳杏', '上超望', 15.00, '2021年');
INSERT INTO `学生竞赛` VALUES ('“iTeach”全国大学生数字化教育应用创新大赛', '《“指”点迷“针”》', '国家级', '一等奖', '徐清妍、郭远帆', '上超望', 15.00, '2021年');
INSERT INTO `学生竞赛` VALUES ('“iTeach”全国大学生数字化教育应用创新大赛', '《滴!请出示行程卡》', '国家级', '一等奖', '邵佳禾、邓欣妍、吴金钰、武婧怡、周研炜', '王世娟、董石', 15.00, '2021年');
INSERT INTO `学生竞赛` VALUES ('“iTeach”全国大学生数字化教育应用创新大赛', '《置换特工队——解密加密的奥秘》', '国家级', '一等奖', '王瑞云、蒋慧婷、鲁红芮、李兆洁、黄露', '杨琳、杨九民', 15.00, '2021年');
INSERT INTO `学生竞赛` VALUES ('“iTeach”全国大学生数字化教育应用创新大赛', '《数字音频瘦身法——基于听觉特性的音频压缩原理》', '国家级', '一等奖', '宋宁宁、刘雨虹、尹馨、陈叶文', '赵刚、杨玉芹', 15.00, '2021年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '《“碳”何容易——诊治温室效应》', '国家级', '二等奖', '李先宇、徐琳、林依然', '蒋玲', 10.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '《云溪镇》', '国家级', '二等奖', '王瑞云、王玥珂、吕远擎、鲁红芮、周雨恬', '王翔', 10.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '《失意者联盟——古诗中那些怀才不遇的人们》', '国家级', '二等奖', '祝莹、王涵、张清雅', '杨琳', 10.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '《踏字寻源——探寻汉字的起源文明》', '国家级', '三等奖', '徐丽梅、徐芯悦、万佳琴、苏美欣、和芊彤', '陈迪、赵肖雄', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '《带汉字之蕴，行传承之路》', '国家级', '三等奖', '黄应涵、段盼盼', '黄磊', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '《国色风华：观诗文五光十色，见汉字处处芳华》', '国家级', '三等奖', '宋宁宁、李雅洁、许蓉蓉', '黄磊', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '《小马爱说话——孤独症儿童语言障碍干预评估APP》', '国家级', '三等奖', '采蕊涵、钮门、王域宇', '刘俐利', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '《吾道》', '国家级', '三等奖', '邵佳禾、刘小慧、黄欣、胡翔瑞、刘朝秋实', '谭政、姚璜', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '《机器世界容万象——走进哈夫曼编码》', '国家级', '三等奖', '蒋慧婷、王瑞云、鲁红芮', '杨琳 杨九民', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '《寻找汉字的前世之旅》', '国家级', '一等奖', '兰雪尹、韦玉炜、李雅洁、颜溶', '田元、姚璜', 15.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '初探声音的数字化', '省级', '二等奖', '刘思悦、许佳怡', '黄磊', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '《DNS域名解析——递归查询、迭代查询》', '省级', '二等奖', '高兴愉、何荣清', '蒋玲', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '给地球降降温——解密蓝碳计划', '省级', '二等奖', '张高雨、黄应涵、郭远帆', '李文昊', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '孤独症儿童道路安全训练系统', '省级', '二等奖', '黄新柯、钟阳、时嘉文', '刘俐利、凌毓涛', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '儿童心理健康及绘画心理分析系统', '省级', '二等奖', '黄欣、邱云豪、邓策渝', '刘俐利、凌毓涛', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '城市内涝', '省级', '二等奖', '王彩云、方苏、王林芝', '龙陶陶', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '言之有意', '省级', '二等奖', '周萌、李佳睿、王子灿、苏高月、邓宝仪', '谭政', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '吾道', '省级', '二等奖', '邵佳禾、刘小慧、黄欣、胡翔瑞、刘朝秋实', '谭政、姚璜', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '寻找汉字的前世之旅', '省级', '二等奖', '兰雪尹、韦玉炜、李雅洁、颜溶', '田元、姚璜', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '云溪镇', '省级', '二等奖', '王瑞云、王玥珂、吕远擎、鲁红芮、周雨恬', '王翔', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '奇妙冬奥世界——历届冬奥会数据可视化', '省级', '二等奖', '蒋慧婷、周志成', '徐家臻', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '助力“30-60”目标，数说双碳行动', '省级', '二等奖', '何昀涛、徐海涛、马国玺', '徐家臻', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '冰墩墩寻宝记——普利姆算法', '省级', '二等奖', '宋汶樾、王奕奕、齐佩骥', '杨九民', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '传承之寻宝', '省级', '二等奖', '徐晓珂、徐涵宇、周思田、张晖', '姚璜', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '《文字脉络》', '省级', '二等奖', '孙若愚、郭子亮、王硕哲、全正', '赵肖雄', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '说文解字', '省级', '二等奖', '苗雨虹、伏思霖、黄云瑶、刘永香、时嘉文', '赵肖雄、陈迪', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '冒泡排序', '省级', '三等奖', '李泽翔、凌婧怡', '罗恒', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '神秘的电报密码', '省级', '三等奖', '张晖、尹馨', '罗恒', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '大学生知识付费兼职网站——\"纸贵 ”', '省级', '三等奖', '邹雨辰、吴宇贤、吴昭', '闵秋莎', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '二分类的智慧——走进逻辑斯蒂回归', '省级', '三等奖', '徐清妍、谌晶靓、邹秦丹', '上超望', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '小规则大智慧——遗传算法的智慧之旅', '省级', '三等奖', '李荣融、戴梦珂', '上超望', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '犬', '省级', '三等奖', '戴婧、马雨晴、刘思源、朱佳琦、陆子欣', '谭政', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '干支密码', '省级', '三等奖', '鲁璟毅', '王翔', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '《“甜蜜的忧伤”——糖尿病的发生与防治》', '省级', '三等奖', '吴雨霏、廖扬', '杨九民', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '疫苗探险记之体液免疫和细胞免疫', '省级', '三等奖', '黄庆琳、陈程、唐雨欣', '杨琳', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '解密“乱码”之源——计算机字符编码', '省级', '一等奖', '贾钰婕、林丽萍、吴雨婷', '陈迪、罗恒', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '踏字寻源——探寻汉字的起源文明', '省级', '一等奖', '徐丽梅、徐芯悦、万佳琴、苏美欣、和芊彤', '陈迪、赵肖雄', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '华中师范大学智慧教室可视化平台', '省级', '一等奖', '采蕊涵、陈明慧、郑皓丹', '戴志诚', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '带汉字之蕴，行传承之路', '省级', '一等奖', '黄应涵、段盼盼', '黄磊', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '国色风华： 观诗文五光十色，见汉字处处芳华', '省级', '一等奖', '宋宁宁、李雅洁、许蓉蓉', '黄磊', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '南极小知识——南极信息可视化', '省级', '一等奖', '王婧然', '黄磊', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '肥胖那些事儿——国人肥胖情况可视化', '省级', '一等奖', '宋宁宁、郭雨晨', '黄磊', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '唐诗宋词中的年龄称谓', '省级', '一等奖', '张媛、方籽妍', '黄磊、杨九民', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '中学生主科学习画像可视化平台', '省级', '一等奖', '张馨妍、陈星宇、肖俊浩', '黄涛', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '“碳”何容易——诊治温室效应', '省级', '一等奖', '李先宇、徐琳、林依然', '蒋玲', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '小马爱说话——孤独症儿童语言障碍干预评估APP', '省级', '一等奖', '采蕊涵、钮门、王域宇', '刘俐利', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '信件巧解TCP/IP体系结构', '省级', '一等奖', '张菊丽、张婷玉', '刘清堂', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '众里寻它千百“路”——初识子网路由', '省级', '一等奖', '郭雨晨、周玥宏、钟佳杏', '上超望', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '二十四节气小课堂——探寻节气古诗里的科学小知识之立春篇', '省级', '一等奖', '吴金钰、黄姝瑜、张驰', '王世娟', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '心肺复苏的秘密', '省级', '一等奖', '潘雨瑶、张卓佳、刘小慧', '王翔', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '“消失”的数字——红绿色盲症病因探究', '省级', '一等奖', '王鑫茹、权佳乐', '杨九民', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '失意者联盟——古诗中那些怀才不遇的人们', '省级', '一等奖', '祝莹、王涵、张清雅', '杨琳', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '机器世界容万象——走进哈夫曼编码', '省级', '一等奖', '蒋慧婷、王瑞云、鲁红芮', '杨琳、杨九民', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '名侦探柯南之寻找失踪的玛丽——人脸识别大探案', '省级', '一等奖', '余梓贤、张耀日、王子月', '赵刚、魏艳涛', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('未来设计师—全国高校数字艺术设计大赛', '请出示健康码', '国家级', '二等奖', NULL, '赵肖雄', 10.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('“互联网”大学生创新创业大赛', '乐益学——面向核心素养的学情智能诊断分析平台', '省级', '三等奖', NULL, '黄涛', 5.00, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '我的色盲从哪里来—初探人类遗传病', '省级', '一等奖', '贺馨月、张雨婷、白璐', NULL, NULL, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '记梦', '省级', '一等奖', '王稼瑞、李志婷、祝启鑫', NULL, NULL, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '“至今思项羽”——唐宋诗歌中的项羽形象分析', '省级', '一等奖', '程染曦', NULL, NULL, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '冬奥印象——带你遨游冬奥数据海洋', '省级', '一等奖', '郭钰洁、王瑞云、吴璇', NULL, NULL, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', 'Nursery——孤独症儿童个性化线上干预康复平台', '省级', '二等奖', '陈佳儿、陈诗怡、曹阳', '凌毓涛', NULL, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '字此中华——文明流变中的汉字', '省级', '二等奖', '廖拉', '张璋', NULL, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', 'HTTPS协议加密原理', '省级', '二等奖', '瞿倩、冉应应', NULL, NULL, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '信息的“熵”与“量”', '省级', '二等奖', '邓欣妍、郭桐羽', NULL, NULL, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '用逆推思维解李白买酒', '省级', '二等奖', '刘倩、郭星怡', NULL, NULL, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '图书功能区空间预约管理系统', '省级', '三等奖', '谭元骏、姬高阳、杨一博', NULL, NULL, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '亲仁善邻，协和万邦', '省级', '三等奖', '王子睿、姬高阳、陈梓烨、丁宁', NULL, NULL, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '量子通信---量子密钥分发', '省级', '三等奖', '王安淇、王晶、李清雅', NULL, NULL, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '题李凝幽居', '省级', '三等奖', '段萌欣、杨成锦', NULL, NULL, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '手机中的“窃听风云”', '省级', '三等奖', '李安琪、吴佳欣、杜禹吉', NULL, NULL, '2022年');
INSERT INTO `学生竞赛` VALUES ('中国大学生计算机设计大赛', '宇宙中的火箭航行', '省级', '三等奖', '张颖新、钱若萱、陈奕君', NULL, NULL, '2022年');


-- ----------------------------
-- Table structure for 教学成果奖
-- ----------------------------
DROP TABLE IF EXISTS `教学成果奖`;
CREATE TABLE `教学成果奖`  (
  `届` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `时间` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `推荐成果名称` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `成果主要完成人姓名` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `获奖类别` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `获奖等级` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `备注` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `工作总量` float(255, 2) NULL DEFAULT NULL

) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of 教学成果奖
-- ----------------------------
INSERT INTO `教学成果奖` VALUES ('第九届', '2022年', '多方协同、两合双动：“人工智能+教育”研究生高质量培养体系的探索与实践', '夏立新、刘清堂、钟文锐、吴砥、李文昊、吴绍靖、王继新、童名文', '省级', '特等奖', '高等学校', 200.00);
INSERT INTO `教学成果奖` VALUES ('第九届', '2022年', '“两并重三协同四融合”，数据驱动的智慧教育创新人才培养模式', '刘三女牙、赵亮、孙建文、李卿、何秀玲、刘智、吴绍靖', '省级', '一等奖', '高等学校', 200.00);
INSERT INTO `教学成果奖` VALUES ('第九届', '2022年', '智能时代卓越数字教师培养—基于《现代教育技术应用》的实践探索', '杨九民、郑旭东、李文昊、蒋玲、杨玉芹、罗恒、王贵才、徐宏敏', '省级', '二等奖', '高等学校', 100.00);
INSERT INTO `教学成果奖` VALUES ('第九届', '2022年', '“三个课堂+AI”促进乡村薄弱学校“开好课”的创新实践', '王继新、左明章、付卫东、郑旭东、宗敏、罗恒', '省级', '特等奖', '基础教育', 200.00);
INSERT INTO `教学成果奖` VALUES ('第九届', '2022年', '中小学“人工智能+教学诊断”深度融合的高质量教学体系的千校探索与实践', '王后雄、邓阳、刘清堂、王世存、顾滢、马善恒', '省级', '一等奖', '基础教育', 200.00);
INSERT INTO `教学成果奖` VALUES ('第九届', '2022年', '数字化卓越教师培养体系的构建与实践', '郝芳华、夏立新、彭双阶、万坚、刘清堂、胡中波、付卫东、杨九民', '省级', '特等奖', '高等学校', 0.00);

-- ----------------------------
-- Table structure for 教学成果奖2
-- ----------------------------
DROP TABLE IF EXISTS `教学成果奖2`;
CREATE TABLE `教学成果奖2`  (
  `成果名称` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `教师` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `教学成果工作量` float(255, 2) NULL DEFAULT NULL
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

INSERT INTO `教学成果奖2` VALUES ('多方协同、两合双动：“人工智能+教育”研究生高质量培养体系的探索与实践', '刘清堂', '60');
INSERT INTO `教学成果奖2` VALUES ('多方协同、两合双动：“人工智能+教育”研究生高质量培养体系的探索与实践', '吴砥', '40');
INSERT INTO `教学成果奖2` VALUES ('多方协同、两合双动：“人工智能+教育”研究生高质量培养体系的探索与实践', '李文昊', '40');
INSERT INTO `教学成果奖2` VALUES ('多方协同、两合双动：“人工智能+教育”研究生高质量培养体系的探索与实践', '王继新', '30');
INSERT INTO `教学成果奖2` VALUES ('多方协同、两合双动：“人工智能+教育”研究生高质量培养体系的探索与实践', '童名文', '30');
INSERT INTO `教学成果奖2` VALUES ('智能时代卓越数字教师培养—基于《现代教育技术应用》的实践探索', '杨九民', '10');




-- ----------------------------
-- Records of 教学成果奖2
-- ----------------------------

-- ----------------------------
-- Table structure for 教研项目
-- ----------------------------
DROP TABLE IF EXISTS `教研项目`;
CREATE TABLE `教研项目`  (
  `项目名称` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `项目负责人` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `项目成员` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `级别` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `立项时间` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `结项时间` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `验收结论` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of 教研项目
-- ----------------------------
INSERT INTO `教研项目` VALUES ('分享式教学中的反思：方法与实践', '黄磊', '杨琳、蒋玲、杨九民、陈迪', '校级', '2018', '2022下', '合格');
INSERT INTO `教研项目` VALUES ('“互联网+”教育背景下《现代教育技术应用》课程教学体系重构', '杨九民', '郑旭东、宁国勤、李文昊、蒋玲、罗恒、黄磊、孟红娟、叶立志', '省级', '2020', '2022上', '合格');
INSERT INTO `教研项目` VALUES ('基于MOOC的师范生信息素养测评与提升', '吴砥', '陈敏、李亚婷、周驰、杨顺莹', '省级', '2020', '2022上', '合格');
INSERT INTO `教研项目` VALUES ('基于深度知识追踪的智能课堂编排研究与实践', '孙建文', '张凯、赵亮、邹睿、杨碧瑶', '校级', '2020', '2022上', '合格');
INSERT INTO `教研项目` VALUES ('产、教、研融合教育模式下的动画专业跨学科人才培养路径研究', '刘俐利', '刘乐元、张坤、彭世新', '校级', '2020', '2022下', '合格');


-- ----------------------------
-- Table structure for 教研项目2
-- ----------------------------
DROP TABLE IF EXISTS `教研项目2`;
CREATE TABLE `教研项目2`  (
  `教师姓名` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `教研项目工作量` float(255, 2) NULL DEFAULT NULL
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

INSERT INTO `教研项目2` VALUES ('黄磊', '80');
INSERT INTO `教研项目2` VALUES ( '杨九民', '120');
INSERT INTO `教研项目2` VALUES ('孙建文', '60');
INSERT INTO `教研项目2` VALUES ('赵亮', '10');
INSERT INTO `教研项目2` VALUES ('李卿', '10');
INSERT INTO `教研项目2` VALUES ('刘俐利', '80');
INSERT INTO `教研项目2` VALUES ( '吴砥', '60');
INSERT INTO `教研项目2` VALUES ( '陈敏', '60');
-- ----------------------------
-- Records of 教研项目2
-- ----------------------------

-- ----------------------------
-- Table structure for 本科工作量教师排序表
-- ----------------------------
DROP TABLE IF EXISTS `本科工作量教师排序表`;
CREATE TABLE `本科工作量教师排序表`  (
  `教工号` varchar(255) NULL DEFAULT NULL,
  `教师名称` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `本科课程总学时` float(255, 2) NULL DEFAULT NULL,
  `课程总学时` float(255, 2) NULL DEFAULT NULL,
  `毕业论文学生人数` int(0) NULL DEFAULT NULL,
  `毕业论文P` float(255, 2) NULL DEFAULT NULL,
  `指导教学实习人数` int(0) NULL DEFAULT NULL,
  `指导教学实习周数` int(0) NULL DEFAULT NULL,
  `指导教学实习P` float(255, 2) NULL DEFAULT NULL,
  `负责实习点建设与管理P` float(255, 2) NULL DEFAULT NULL,
  `指导本科生竞赛P` float(255, 2) NULL DEFAULT NULL,
  `指导本科生科研P` float(255, 2) NULL DEFAULT NULL,
  `本科生导师制` float(255, 2) NULL DEFAULT NULL,
  `教研教改P` float(255, 2) NULL DEFAULT NULL,
  `一流课程` float(255, 2) NULL DEFAULT NULL,
  `教学成果奖` float(255, 2) NULL DEFAULT NULL,
  `公共服务` float(255, 2) NULL DEFAULT NULL
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;





-- ----------------------------
-- Records of 本科工作量教师排序表
-- ----------------------------

-- ----------------------------
-- Table structure for 本科工作量课程排序表
-- ----------------------------
DROP TABLE IF EXISTS `本科工作量课程排序表`;
CREATE TABLE `本科工作量课程排序表`  (
  `学年` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `学期` int(0) NULL DEFAULT NULL,
  `自然年` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `上下半年` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `课程号` int(0) NULL DEFAULT NULL,
  `课程名称` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `教工号` varchar(255) NULL DEFAULT NULL,
  `教师名称` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `研讨学时` int(0) NULL DEFAULT NULL,
  `授课学时` int(0) NULL DEFAULT NULL,
  `实验学时` int(0) NULL DEFAULT NULL,
  `选课人数` int(0) NULL DEFAULT NULL,
  `学生数量权重系数B` float(255, 2) NULL DEFAULT NULL,
  `课程类型系数A` float(255, 2) NULL DEFAULT NULL,
  `理论课总学时P1` float(255, 2) NULL DEFAULT NULL,
  `实验分组数` int(0) NULL DEFAULT NULL,
  `实验课系数` float(255, 2) NULL DEFAULT NULL,
  `实验课总学时P2` float(255, 2) NULL DEFAULT NULL,
  `课程拆分占比` float(255, 2) NULL DEFAULT NULL,
  `本科课程总学时` float(255, 2) NULL DEFAULT NULL,
  `课程总学时` float(255, 2) NULL DEFAULT NULL
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;



--计算学生数量权重系数B
DELIMITER //
CREATE TRIGGER calculate_student_weight BEFORE INSERT ON `本科工作量课程排序表`
FOR EACH ROW
BEGIN
    DECLARE student_weight FLOAT(255, 2);
    IF NEW.选课人数 <= 45 THEN
        SET student_weight = 0;
    ELSEIF NEW.选课人数 > 45 AND NEW.选课人数 <= 55 THEN
        SET student_weight = 0.1;
    ELSEIF NEW.选课人数 > 55 AND NEW.选课人数 <= 65 THEN
        SET student_weight = 0.2;
    ELSE
        SET student_weight = 0.3;
    END IF;
    SET NEW.学生数量权重系数B = student_weight;
END//
DELIMITER ;



--计算理论课总学时，实验课总学时，本科课程总学时
DELIMITER //
CREATE TRIGGER calculate_hours BEFORE INSERT ON `本科工作量课程排序表`
FOR EACH ROW
BEGIN
    SET NEW.理论课总学时P1 = (NEW.研讨学时 + NEW.授课学时) * NEW.课程类型系数A * (1 + NEW.学生数量权重系数B);
    SET NEW.实验课总学时P2 = NEW.实验学时 * NEW.实验分组数 * NEW.实验课系数;
    SET NEW.本科课程总学时 = NEW.理论课总学时P1 + NEW.实验课总学时P2;
END//
DELIMITER ;



--判断实验课系数小于等于1
DELIMITER //
CREATE TRIGGER check_experiment_coefficient BEFORE INSERT ON `本科工作量课程排序表`
FOR EACH ROW
BEGIN
    IF NEW.实验课系数 > 1 THEN
        SIGNAL SQLSTATE '45000' SET MESSAGE_TEXT = '实验课系数的值必须小于1';
    END IF;
END//
DELIMITER ;






--判断课时拆分占比小于等于1
DELIMITER //
CREATE TRIGGER check_course_split_ratio BEFORE INSERT ON `本科工作量课程排序表`
FOR EACH ROW
BEGIN
    IF NEW.`课程拆分占比` > 1 THEN
        SIGNAL SQLSTATE '45000' SET MESSAGE_TEXT = '课程拆分占比（工程中心用）的值必须小于1';
    END IF;
END//
DELIMITER ;




--计算课程总学时
DELIMITER //
CREATE TRIGGER calculate_course_total_hours BEFORE INSERT ON `本科工作量课程排序表`
FOR EACH ROW
BEGIN
    SET NEW.课程总学时 = NEW.授课学时 + NEW.研讨学时 + NEW.实验学时;
END//
DELIMITER ;


--计算学生数量权重系数B
DELIMITER //
CREATE TRIGGER calculate_student_weight2 BEFORE UPDATE ON `本科工作量课程排序表`
FOR EACH ROW
BEGIN
    DECLARE student_weight FLOAT(255, 2);
    IF NEW.选课人数 <= 45 THEN
        SET student_weight = 0;
    ELSEIF NEW.选课人数 > 45 AND NEW.选课人数 <= 55 THEN
        SET student_weight = 0.1;
    ELSEIF NEW.选课人数 > 55 AND NEW.选课人数 <= 65 THEN
        SET student_weight = 0.2;
    ELSE
        SET student_weight = 0.3;
    END IF;
    SET NEW.学生数量权重系数B = student_weight;
END//
DELIMITER ;



--计算理论课总学时，实验课总学时，本科课程总学时
DELIMITER //
CREATE TRIGGER calculate_hours2 BEFORE UPDATE ON `本科工作量课程排序表`
FOR EACH ROW
BEGIN
    SET NEW.理论课总学时P1 = (NEW.研讨学时 + NEW.授课学时) * NEW.课程类型系数A * (1 + NEW.学生数量权重系数B);
    SET NEW.实验课总学时P2 = NEW.实验学时 * NEW.实验分组数 * NEW.实验课系数;
    SET NEW.本科课程总学时 = NEW.理论课总学时P1 + NEW.实验课总学时P2;
END//
DELIMITER ;



--判断实验课系数小于等于1
DELIMITER //
CREATE TRIGGER check_experiment_coefficient2 BEFORE UPDATE ON `本科工作量课程排序表`
FOR EACH ROW
BEGIN
    IF NEW.实验课系数 > 1 THEN
        SIGNAL SQLSTATE '45000' SET MESSAGE_TEXT = '实验课系数的值必须小于1';
    END IF;
END//
DELIMITER ;






--判断课时拆分占比小于等于1
DELIMITER //
CREATE TRIGGER check_course_split_ratio2 BEFORE UPDATE ON `本科工作量课程排序表`
FOR EACH ROW
BEGIN
    IF NEW.`课程拆分占比` > 1 THEN
        SIGNAL SQLSTATE '45000' SET MESSAGE_TEXT = '课程拆分占比（工程中心用）的值必须小于1';
    END IF;
END//
DELIMITER ;




--计算课程总学时
DELIMITER //
CREATE TRIGGER calculate_course_total_hours2 BEFORE UPDATE ON `本科工作量课程排序表`
FOR EACH ROW
BEGIN
    SET NEW.课程总学时 = NEW.授课学时 + NEW.研讨学时 + NEW.实验学时;
END//
DELIMITER ;

INSERT INTO `本科工作量课程排序表` VALUES ('2021', '2','2021','上','41620316','教育电视节目编制','2009980086','范炀','0','32','2','22','0','1','31','1','1','0',1,'32',NULL);
INSERT INTO `本科工作量课程排序表` VALUES ('2021', '2','2021','上','41620317','教育电视节目编制实验','2009980086','范炀','0','0','16','21','0','1','0','2','0.8','25.6',1,'32',NULL);



UPDATE 本科工作量教师排序表 AS t1
INNER JOIN 本科工作量课程排序表 AS t2
ON t1.`教工号` = t2.`教工号`
SET
  t1.`教师名称` = t2.`教师名称`,
  t1.`本科课程总学时` = t2.`本科课程总学时`,
  t1.`课程总学时` = t2.`课程总学时`;











-- ----------------------------
-- Records of 本科工作量课程排序表
-- ----------------------------

-- ----------------------------
-- Table structure for 本科生导师制
-- ----------------------------
DROP TABLE IF EXISTS `本科生导师制`;
CREATE TABLE `本科生导师制`  (
  `导师姓名` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `教工号` varchar(255) NULL DEFAULT NULL,
  `学生姓名` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `年级` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `学号` int(0) NULL DEFAULT NULL,
  `说明` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of 本科生导师制
-- ----------------------------
INSERT INTO `本科生导师制` VALUES ('黄磊', NULL, '蒋珂', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('黄磊', NULL, '叶双', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('蒋玲', NULL, '沈迎凤', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('蒋玲', NULL, '李兆洁', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('李文昊', NULL, '蔡逸洋', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('李文昊', NULL, '苏文英', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('李文昊', NULL, '刘诗睿', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('李文昊', NULL, '陈子祺', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('刘丹', NULL, '郑清', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('刘清堂', NULL, '侯思冉', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('罗恒', NULL, '王佩煜', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('罗恒', NULL, '刘洁', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('罗恒', NULL, '陈天娇', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('上超望', NULL, '杨诗涵', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('童名文', NULL, '汪洋', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('童名文', NULL, '侯沛露', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('童名文', NULL, '朱雪莉', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('童名文', NULL, '王思萍', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('王继新', NULL, '熊炜', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('徐家臻', NULL, '陈守萍', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('徐家臻', NULL, '朱菁洋', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('杨九民', NULL, '刘瑾瑾', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('杨九民', NULL, '石越文', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('杨九民', NULL, '程欣艳', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('杨琳', NULL, '崔佳睿', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('张屹', NULL, '黄皓', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('张屹', NULL, '齐可意', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('张屹', NULL, '侯兆鑫', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('周平红', NULL, '庞清', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('周平红', NULL, '尹莉娜', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('左明章', NULL, '杨海', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('林裕仁', NULL, '曹文君', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('林裕仁', NULL, '喻星星', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('龙陶陶', NULL, '邱璐莹', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('庞世燕', NULL, '郑康', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('庞世燕', NULL, '何堰清', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('郑旭东', NULL, '莫濡菲', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('郑旭东', NULL, '罗霞', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('郑旭东', NULL, '陈明凤', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('陈迪', NULL, '李婷婷', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('陈迪', NULL, '郭怡欣', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('陈迪', NULL, '邓妍', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('陈加', NULL, '刘章映', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('范炀', NULL, '程煌惠', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('范炀', NULL, '李汇之', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('范炀', NULL, '黄兆琦', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('闵秋莎', NULL, '蒲丽娟', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('闵秋莎', NULL, '徐飞龙', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('闵秋莎', NULL, '任思萍', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('谭政', NULL, '贺文轩', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('谭政', NULL, '周冀立', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('谭政', NULL, '刘佳乐', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('谭政', NULL, '黄婕', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('谭政', NULL, '张晓瑜', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('田元', NULL, '梁丝漪', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('田元', NULL, '张艳萍', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('田元', NULL, '梁剑豪', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('王志锋', NULL, '马莹', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('王志锋', NULL, '邹丽超', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('王志锋', NULL, '徐卓然', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('王志锋', NULL, '杨炳娜', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('王志锋', NULL, '李乐潇', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('夏丹', NULL, '王祯妮', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('姚璜', NULL, '朱佳琦', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('姚璜', NULL, '陆子欣', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('赵肖雄', NULL, '王雨欣1（数媒）', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('赵肖雄', NULL, '何静', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('赵肖雄', NULL, '刘雨桐', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('庄文杰', NULL, '李良亚', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('庄文杰', NULL, '阳卓君', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('庄文杰', NULL, '刘佳惠', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('庄文杰', NULL, '胡汇', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('董石', NULL, '谢夏风', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('洪澄瑜', NULL, '沈可心', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('魏艳涛', NULL, '高天娇', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('魏艳涛', NULL, '郭冰倩', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('魏艳涛', NULL, '郑文彬', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('肖克江', NULL, '王雨欣2（数媒）', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('杨玉芹', NULL, '王雨欣3（教技）', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('杨玉芹', NULL, '邓樊博文', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('杨玉芹', NULL, '阳思雨', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('张思', NULL, '陈红朱', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('张思', NULL, '陈洁盈', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('欧阳泓杰', NULL, '郑子澳', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('欧阳泓杰', NULL, '任彬', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('欧阳泓杰', NULL, '毕美琪', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('王贵才', NULL, '李青梅', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('王贵才', NULL, '吴佳敏', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('王贵才', NULL, '许思诺', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('王翔', NULL, '黄燚', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('王翔', NULL, '余哲', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('王翔', NULL, '程千千', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('王翔', NULL, '侯汶君', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('陈迪', NULL, '钱龙', '18', NULL, '18级21年补报');
INSERT INTO `本科生导师制` VALUES ('蒋玲', NULL, '文璋', '18', NULL, '18级21年补报');
INSERT INTO `本科生导师制` VALUES ('蒋玲', NULL, '黄露', '18', NULL, '18级21年补报');
INSERT INTO `本科生导师制` VALUES ('林裕仁', NULL, '肖菁婧', '18', NULL, '18级21年补报');
INSERT INTO `本科生导师制` VALUES ('龙陶陶', NULL, '梅傲雪', '18', NULL, '18级21年补报');
INSERT INTO `本科生导师制` VALUES ('罗恒', NULL, '徐欣悦', '18', NULL, '18级21年补报');
INSERT INTO `本科生导师制` VALUES ('田元', NULL, '张雯', '18', NULL, '18级21年补报');
INSERT INTO `本科生导师制` VALUES ('王贵才', NULL, '唐佳宇', '18', NULL, '18级21年补报');
INSERT INTO `本科生导师制` VALUES ('徐家臻', NULL, '安莹镒', '18', NULL, '18级21年补报');
INSERT INTO `本科生导师制` VALUES ('龙陶陶', NULL, '郝明霞', '18', NULL, '18级21年补报');
INSERT INTO `本科生导师制` VALUES ('陈迪', NULL, '王玥珂', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('陈迪', NULL, '徐丽梅', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('陈迪', NULL, '许慧婷', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('陈迪', NULL, '童丁诺', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('董石', NULL, '徐晓珂', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('范炀', NULL, '杨雨欣', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('范炀', NULL, '周思田', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('范炀', NULL, '胡诗唯', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('范炀', NULL, '吕远擎', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('洪澄瑜', NULL, '杨欣怡', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('罗恒', NULL, '何荣清', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('黄磊', NULL, '李荣融', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('黄磊', NULL, '戴梦珂', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('黄磊', NULL, '王涵', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('黄磊', NULL, '张媛', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('蒋玲', NULL, '王钰慧', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('李文昊', NULL, '丁璐瑶', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('李文昊', NULL, '程染曦', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('李文昊', NULL, '钟悦文', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('刘丹', NULL, '陈炎东', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('刘丹', NULL, '王建宇', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('刘丹', NULL, '郭钰洁', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('刘清堂', NULL, '李清雅', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('刘清堂', NULL, '王安淇', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('刘清堂', NULL, '张婷玉', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('龙陶陶', NULL, '徐莹', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('龙陶陶', NULL, '赵雅', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('龙陶陶', NULL, '刘佳雨', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('罗恒', NULL, '宋宁宁', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('罗恒', NULL, '杨嘉欣', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('罗恒', NULL, '尹馨', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('闵秋莎', NULL, '施妍玟', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('欧阳泓杰', NULL, '谢纪元', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('庞世燕', NULL, '刘学江', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('庞世燕', NULL, '余智聪', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('庞世燕', NULL, '罗文娟', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('庞世燕', NULL, '刘悦', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('谭政', NULL, '徐欢', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('谭政', NULL, '戴婧', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('谭政', NULL, '张明洋', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('谭政', NULL, '汤俊搏', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('田元', NULL, '雷梦婷', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('田元', NULL, '徐涵宇', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('田元', NULL, '钱宇飞', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('田元', NULL, '张志浩', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('童名文', NULL, '韦玉玮', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('童名文', NULL, '周玥宏', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('徐家臻', NULL, '瞿倩', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('童名文', NULL, '徐海涛', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('涂凌琳', NULL, '赵珊珊', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('涂凌琳', NULL, '周雨恬', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('涂凌琳', NULL, '张雪扬', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('涂凌琳', NULL, '周乐言', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('王继新', NULL, '祝莹', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('王继新', NULL, '王子月', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('王翔', NULL, '李世龙', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('王翔', NULL, '孟凡瑶', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('王志锋', NULL, '斯雨婕', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('王忠华', NULL, '叶海晴', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('魏艳涛', NULL, '张耀日', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('肖克江', NULL, '程玮瑶', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('肖克江', NULL, '张晶', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('徐家臻', NULL, '马国玺', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('徐家臻', NULL, '方籽妍', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('杨九民', NULL, '王婧然', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('杨九民', NULL, '王瑞云', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('杨九民', NULL, '何昀涛', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('杨玉芹', NULL, '余梓贤', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('杨玉芹', NULL, '张晖', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('张思', NULL, '邓雨欣', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('张思', NULL, '鹿爽', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('张屹', NULL, '蒋慧婷', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('张屹', NULL, '王晶', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('张屹', NULL, '朱慧琳', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('庞世燕', NULL, '白雨欣', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('林裕仁', NULL, '钟晗', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('林裕仁', NULL, '樊瑶', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('周平红', NULL, '张芬', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('周平红', NULL, '孔月', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('庄文杰', NULL, '张菊丽', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('左明章', NULL, '兰雪尹', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('左明章', NULL, '颜溶', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('王翔', NULL, '吴佳欣', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('欧阳泓杰', NULL, '朱宇晨', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('赵肖雄', NULL, '叶慧霞', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('陈靓影', NULL, '范媛柯', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('黄涛', NULL, '张天翼', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('朱晓亮', NULL, '马桂雨', '19', NULL, '19级21年补报');
INSERT INTO `本科生导师制` VALUES ('陈迪', NULL, '徐依萍', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('陈迪', NULL, '王域宇', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('陈迪', NULL, '唐斌', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('陈迪', NULL, '李佳睿', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('陈加', NULL, '雷霆', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('陈加', NULL, '孙奥', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('范炀', NULL, '苏美欣', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('范炀', NULL, '易梓稔', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('范炀', NULL, '吴雨婷', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('范炀', NULL, '吴雅欣', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('范炀', NULL, '戴薇', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('黄磊', NULL, '杜梦益', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('林裕仁', NULL, '周秋鹤', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('刘清堂', NULL, '武婧怡', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('罗恒', NULL, '邓欣妍', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('罗恒', NULL, '蒋思懿', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('罗恒', NULL, '张芷莉', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('罗恒', NULL, '黄庆琳', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('欧阳泓杰', NULL, '李欣艺', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('庞世燕', NULL, '陈旸婧', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('庞世燕', NULL, '左琳', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('上超望', NULL, '王亚楠', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('上超望', NULL, '宋田尧', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('谭政', NULL, '邵佳禾', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('谭政', NULL, '刘思源', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('谭政', NULL, '马雨晴', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('谭政', NULL, '王瑞婷', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('谭政', NULL, '周萌', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('谭政', NULL, '邓宇晗', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('童名文', NULL, '王章仲', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('黄磊', NULL, '艾祺顶', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('童名文', NULL, '李欣滢', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('魏艳涛', NULL, '贾钰婕', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('童名文', NULL, '夏然然', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('王世娟', NULL, '王金润', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('王翔', NULL, '苏高月', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('王翔', NULL, '黄云瑶', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('王轩', NULL, '黄姝瑜', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('王轩', NULL, '解婷雅', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('王志锋', NULL, '胡翔瑞', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('王志锋', NULL, '梁小威', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('王志锋', NULL, '莫程泽', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('魏艳涛', NULL, '路亚萍', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('魏艳涛', NULL, '王鑫茹', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('肖克江', NULL, '黄星杰', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('肖克江', NULL, '谌晶靓', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('徐家臻', NULL, '虞东键', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('徐家臻', NULL, '臧天赐', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('杨九民', NULL, '宋汶樾', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('杨九民', NULL, '王奕奕', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('张思', NULL, '郭桐羽', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('张思', NULL, '贺馨月', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('张思', NULL, '王一垚', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('张思', NULL, '张雨婷', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('赵刚', NULL, '张高雨', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('郑旭东', NULL, '吴金钰', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('上超望', NULL, '徐清妍', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('周平红', NULL, '朱晨静', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('庄文杰', NULL, '伏思霖', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('庄文杰', NULL, '吴映彤', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('庄文杰', NULL, '时嘉文', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('左明章', NULL, '段盼盼', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('左明章', NULL, '邓宝仪', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('陈靓影', NULL, '李毅佳', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('陈靓影', NULL, '刘文君', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('陈增照', NULL, '缪秉辰', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('杜旭', NULL, '范力源', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('杜旭', NULL, '邓策渝', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('何秀玲', NULL, '张雅慧', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('黄涛', NULL, '张馨妍', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('刘海', NULL, '宋林森', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('刘乐元', NULL, '苗惠清', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('刘乐元', NULL, '叶婷', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('刘乐元', NULL, '张云汇', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('刘俐利', NULL, '黄应涵', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('刘俐利', NULL, '秦金涵', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('刘俐利', NULL, '黄新柯', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('刘三女牙', NULL, '邬丽婷', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('刘三女牙', NULL, '李淑芳', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('刘三女牙', NULL, '李佳敏', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('刘三女牙', NULL, '秦梓雯', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('刘智', NULL, '陈凯旋', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('彭世新', NULL, '王宁', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('孙建文', NULL, '张琳', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('吴砥', NULL, '陈星宇', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('吴砥', NULL, '梁思思', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('吴珂', NULL, '郭远帆', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('余新国', NULL, '廖顺行', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('张婷', NULL, '徐菁宜', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('赵亮', NULL, '贾宇豪', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('钟正', NULL, '汤兵兵', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('周东波', NULL, '孙晓丹', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('周东波', NULL, '高愉淇', '20', NULL, '20级21年新报');
INSERT INTO `本科生导师制` VALUES ('陈靓影', NULL, '毛懋', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('陈矛', NULL, '陈聪', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('陈敏', NULL, '陈斐', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('陈增照', NULL, '陈佳敏', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('戴志诚', NULL, '丁安琪', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('杜旭', NULL, '奚美娟', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('何彬', NULL, '陈胜男', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('何秀玲', NULL, '尹娜', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('黄涛', NULL, '徐晨曦', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('李浩', NULL, '张笑典', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('廖盛斌', NULL, '温龙超', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('刘海', NULL, '周思雨', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('刘澜', NULL, '夏勇正', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('刘乐元', NULL, '谢俊', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('刘三女牙', NULL, '冯锦天', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('刘智', NULL, '罗超洋', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('卢春', NULL, '欧鑫佳', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('彭世新', NULL, '韩邵杭', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('石映辉', NULL, '王泽楷', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('舒江波', NULL, '高玉乾', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('粟柱', NULL, '梁志宇', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('孙超', NULL, '黄温瑞', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('孙建文', NULL, '胡昕曈', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('王泰', NULL, '胡典', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('吴砥', NULL, '刘一泓', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('吴珂', NULL, '孙志攀', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('易宝林', NULL, '谯磊', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('余新国', NULL, '刘怡文', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('张浩', NULL, '肖子琦', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('张俊松', NULL, '苟璇如', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('张维', NULL, '刘兆辰', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('张昭理', NULL, '刘益宁', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('赵亮', NULL, '屈仁弟', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('郑年亨', NULL, '李冰冰', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('钟正', NULL, '徐雪碧', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('周东波', NULL, '贺文倩', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('周鹏', NULL, '屈俊杰', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('朱晓亮', NULL, '党倬政', '18', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('曾致中', NULL, '曹阳', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('陈靓影', NULL, '曹宸瑞', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('陈敏', NULL, '刘迪妮', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('戴志诚', NULL, '吴雪冰', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('杜旭', NULL, '姚孟奇', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('何秀玲', NULL, '张一', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('黄涛', NULL, '朱俊雅', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('李睿', NULL, '张旭', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('李亚婷', NULL, '邵润琪', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('廖盛斌', NULL, '徐雨隆', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('刘海', NULL, '范思泽', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('刘澜', NULL, '黄维雅', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('刘俐利', NULL, '颜喜乐', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('刘三女牙', NULL, '李方菁', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('刘智', NULL, '张梓萱', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('卢春', NULL, '陈诗怡', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('彭世新', NULL, '王乐璇', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('石映辉', NULL, '饶燕姣', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('粟柱', NULL, '鲍诚杰', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('孙超', NULL, '韩泽安', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('孙建文', NULL, '吕佳凝', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('王泰', NULL, '义晓洁', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('吴砥', NULL, '陈佳儿', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('吴珂', NULL, '郑子路', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('易宝林', NULL, '李韵远', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('余新国', NULL, '王金华', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('张浩', NULL, '陈明慧', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('张俊松', NULL, '周蔚博', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('张立山', NULL, '采蕊涵', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('张维', NULL, '刘聪', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('张昭理', NULL, '马萌欣', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('赵亮', NULL, '吴可馨', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('郑年亨', NULL, '郑皓丹', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('钟正', NULL, '江素娟', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('周东波', NULL, '邱逢瑜', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('周鹏', NULL, '孟镕媛', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('朱晓亮', NULL, '傅自勋', '19', NULL, NULL);
INSERT INTO `本科生导师制` VALUES ('罗恒', NULL, '王子灿', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('左明章', NULL, '王艳婷', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('陈敏', NULL, '王天天', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('黄磊', NULL, '饶家璐', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('李文昊', NULL, '刘兆歌', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('罗恒', NULL, '龚鑫露', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('王世娟', NULL, '贾生婷', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('杨玉芹', NULL, '李嘉楠', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('张屹', NULL, '和芊彤', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('张屹', NULL, '张驰', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('龙陶陶', NULL, '蔡梦瑶', '20', NULL, '22年选配，由于导师离职，重新选择导师');
INSERT INTO `本科生导师制` VALUES ('龙陶陶', NULL, '王玲芳', '20', NULL, '22年选配，由于导师离职，重新选择导师');
INSERT INTO `本科生导师制` VALUES ('龙陶陶', NULL, '何姝玥', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('庞世燕', NULL, '李璟怡', '20', NULL, '22年选配，由于导师离职，重新选择导师');
INSERT INTO `本科生导师制` VALUES ('王翔', NULL, '许蓉蓉', '20', NULL, '22年选配，由于导师离职，重新选择导师');
INSERT INTO `本科生导师制` VALUES ('李睿', NULL, '姚玉函', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('刘海', NULL, '张诚', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('刘智', NULL, '张鼎镇', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('孙建文', NULL, '王林慧', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('孙建文', NULL, '解禹正', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('王涛', NULL, '龚拓', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('张昭理', NULL, '王镜淇', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('陈增照', NULL, '何瑛琪', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('何彬', NULL, '潘科文', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('刘海', NULL, '李春来', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('卢春', NULL, '杨梦婷', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('张昭理', NULL, '林单月', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('陈迪', NULL, '侯秋凤', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('陈迪', NULL, '潘雨瑶', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('范炀', NULL, '万佳琴', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('欧阳泓杰', NULL, '徐芯悦', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('姚璜', NULL, '欧阳桃', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('赵肖雄', NULL, '林丽萍', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('赵肖雄', NULL, '王硕哲', '20', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('刘清堂', NULL, '喻雅琴', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('罗恒', NULL, '李泽翔', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('罗恒', NULL, '田嘉沂', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('罗恒', NULL, '刘倩', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('罗恒', NULL, '李想', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('童名文', NULL, '朱郡奕', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('童名文', NULL, '凌婧怡', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('汪丽梅', NULL, '汪文洁', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('杨九民', NULL, '郑渝晴', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('杨九民', NULL, '刘俊麟', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('杨九民', NULL, '杨珊', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('杨玉芹', NULL, '苏叶梓', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('张思', NULL, '孔桂丽', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('张思', NULL, '季文洁', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('左明章', NULL, '张一珊', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('左明章', NULL, '古雅静', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('何彬', NULL, '李晓薇', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('黄磊', NULL, '段萌欣', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('黄磊', NULL, '杨媛凡', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('蒋玲', NULL, '张馨怡', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('蒋玲', NULL, '杨思羽', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('李文昊', NULL, '林钰铭', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('李文昊', NULL, '马欣妤', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('李秀晗', NULL, '程舒', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('刘清堂', NULL, '孙静雯', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('罗恒', NULL, '张颖新', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('上超望', NULL, '陈晓晓', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('上超望', NULL, '邓南清', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('童名文', NULL, '钱若萱', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('童名文', NULL, '陈奕君', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('童名文', NULL, '金传倩', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('吴林静', NULL, '王培侠', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('吴林静', NULL, ' 向思颖', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('吴林静', NULL, '祝启鑫', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('肖克江', NULL, '马攀威', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('杨九民', NULL, '权佳乐', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('杨九民', NULL, '陈琦帆', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('杨玉芹', NULL, '周牧菁', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('张思', NULL, '杨成锦', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('张思', NULL, '张迎选', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('张屹', NULL, '李亮', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('钟正', NULL, '李晓阳', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('周平红', NULL, '郭星怡', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('周平红', NULL, '李嘉莹', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('庄文杰', NULL, '孙娜', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('左明章', NULL, '吴锐', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('刘智', NULL, '孙家琪', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('刘智', NULL, '严习月', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('龙陶陶', NULL, '魏高雅', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('龙陶陶', NULL, '王林芝', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('庞世燕', NULL, '刘依林', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('庞世燕', NULL, '薛畅', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('庞世燕', NULL, '周萱', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('彭晛', NULL, '朱振凯', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('彭晛', NULL, '方苏', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('汪丽梅', NULL, '王慧莹', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('王世娟', NULL, '毕雪琴', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('王世娟', NULL, '李诗妍', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('魏艳涛', NULL, '彭秋涵', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('魏艳涛', NULL, '胡诗雨', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('魏艳涛', NULL, '李钰菁', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('郑旭东', NULL, '徐邈', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('蔡畅', NULL, '胡红袖', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('陈靓影', NULL, '付佳雯', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('陈靓影', NULL, '史叶伟', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('陈增照', NULL, '王筱萌', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('何彬', NULL, '屈恩福', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('粟柱', NULL, '谢伦智', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('廖盛斌', NULL, '田力', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('刘海', NULL, '李洵', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('刘乐元', NULL, '李晶鑫', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('刘乐元', NULL, '李果果', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('刘乐元', NULL, '谢宇琪', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('牛磊', NULL, '元子权', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('牛磊', NULL, '周俊豪', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('牛磊', NULL, '马银', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('彭世新', NULL, '陈书研', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('彭世新', NULL, '徐畅', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('彭世新', NULL, '周如萍', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('彭世新', NULL, '肖雅雯', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('粟柱', NULL, '许耀', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('王涛', NULL, '崔向阳', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('王涛', NULL, '唐瑜', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('王涛', NULL, '赵子晗', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('肖克江', NULL, '黄慧斌', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('陈靓影', NULL, '姬高阳', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('陈靓影', NULL, '谭元骏', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('陈敏', NULL, '龙腾', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('黄涛', NULL, '鲁晶瑶', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('黄涛', NULL, '陈秋宏', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('黄涛', NULL, '郭兆博', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('李卿', NULL, '刘语墨', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('李卿', NULL, '王稼瑞', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('李卿', NULL, '韦婧祺 ', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('刘海', NULL, '王彩云', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('刘俐利', NULL, '陈国涛', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('刘三女牙', NULL, '刘良柱', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('刘智', NULL, '杨一博', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('孙建文', NULL, '张颖', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('王泰', NULL, '陈程', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('王泰', NULL, '吴松', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('肖克江', NULL, '肖博文', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('姚璜', NULL, '余恒宇', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('余新国', NULL, '李彦达', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('余新国', NULL, '林舒锦', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('赵亮', NULL, '李嘉琪', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('赵亮', NULL, '柴文慧', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('赵亮', NULL, '吴慧欣', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('周东波', NULL, '杜奕锋', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('朱晓亮', NULL, '周婉婷', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('陈迪', NULL, '王贞颖', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('陈迪', NULL, '陈姣', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('陈迪', NULL, '郭蕴琦', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('陈加', NULL, '余林蔚', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('陈加', NULL, '何晓蕙', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('陈加', NULL, '任香郡', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('陈加', NULL, '蔡欣芷', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('董石', NULL, '叶王子', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('范炀', NULL, '陈诗萍', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('范炀', NULL, '汪炜', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('刘俐利', NULL, '刘晨萱', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('刘俐利', NULL, '吴昌宏', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('欧阳泓杰', NULL, '蔡文沛', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('田元', NULL, '刘文婷', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('田元', NULL, '唐雨欣', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('王翔', NULL, '鲁璟毅', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('王翔', NULL, '刘宇洋', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('王轩', NULL, '詹雨鑫', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('王轩', NULL, '梁加宝', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('王志锋', NULL, '郑昕玥', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('王志锋', NULL, '邹雨辰', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('王志锋', NULL, '董曜伟', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('王志锋', NULL, '李冰洁', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('夏丹', NULL, '李婷', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('夏丹', NULL, '胡清会', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('姚璜', NULL, '蒋晨轩', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('赵肖雄', NULL, '黄丹蕾', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('赵肖雄', NULL, '樊智康', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('赵肖雄', NULL, '马妍', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('谭政', NULL, '陈伊然', '21', NULL, '22年选配');
INSERT INTO `本科生导师制` VALUES ('谭政', NULL, '刘鑫怡', '21', NULL, '22年选配');

SET FOREIGN_KEY_CHECKS = 1;


DELIMITER //
CREATE TRIGGER update_teacher_workload AFTER INSERT ON `本科工作量课程排序表`
FOR EACH ROW
BEGIN
    DECLARE total_course_hours float(255, 2);
    DECLARE total_undergraduate_hours float(255, 2);
    DECLARE graduate_count int(0);
    DECLARE teaching_internship_count int(0);
    DECLARE undergraduate_competition_p float(255, 2);
    DECLARE undergraduate_mentorship_count int(0);
    DECLARE research_project_p float(255, 2);
    DECLARE excellent_course_count int(0);
    DECLARE teaching_award_count int(0);
    DECLARE announcement_service_hours float(255, 2);
    
    -- 计算本科课程总学时和课程总学时
    SELECT SUM(`本科课程总学时`) INTO total_undergraduate_hours FROM `本科工作量课程排序表` WHERE `教工号` = NEW.`教工号`;
    SELECT SUM(`课程总学时`) INTO total_course_hours FROM `本科工作量课程排序表` WHERE `教工号` = NEW.`教工号`;

    
    -- 更新本科工作量教师排序表
    UPDATE `本科工作量教师排序表` SET 
        `教师名称` = NEW.`教师名称`,
        `本科课程总学时` = total_undergraduate_hours,
        `课程总学时` = total_course_hours

    WHERE `教工号` = NEW.`教工号`;
END//
DELIMITER ;

-- 存储过程：在数据库有任何更新时重新计算更新记录
DELIMITER //
CREATE PROCEDURE recompute_workload()
BEGIN
    -- 清空本科工作量教师排序表
    TRUNCATE TABLE `本科工作量教师排序表`;
    
    -- 插入符合要求的记录到本科工作量教师排序表
    INSERT INTO `本科工作量教师排序表` (教工号)
    SELECT DISTINCT 教工号 FROM `本科工作量课程排序表`;
    
UPDATE `本科工作量教师排序表` AS t1
INNER JOIN `本科工作量课程排序表` AS t2 ON t1.`教工号` = t2.`教工号`
SET t1.`教师名称` = t2.`教师名称`;

    -- 更新本科工作量教师排序表中的记录
UPDATE `本科工作量教师排序表` AS t1
INNER JOIN (
    SELECT 
        教工号,
        SUM(`本科课程总学时`) AS 本科课程总学时,
        SUM(`课程总学时`) AS 课程总学时
    FROM `本科工作量课程排序表` AS t2
    GROUP BY 教工号
) AS t3 ON t1.`教工号` = t3.`教工号`
SET 
    t1.`本科课程总学时` = t3.`本科课程总学时`,
    t1.`课程总学时` = t3.`课程总学时`;

UPDATE `本科工作量教师排序表` AS t1
INNER JOIN (
    SELECT 
        `毕业论文指导老师`,
        COUNT(*) AS 毕业论文学生人数
    FROM `毕业论文`
    GROUP BY `毕业论文指导老师`
) AS t2 ON t1.`教师名称` = t2.`毕业论文指导老师`
SET t1.`毕业论文学生人数` = t2.`毕业论文学生人数`;

UPDATE `本科工作量教师排序表`
SET `毕业论文P` = `毕业论文学生人数` * 8;

UPDATE `本科工作量教师排序表` AS t1
SET t1.`指导教学实习人数` = COALESCE((
    SELECT COUNT(*)
    FROM `本科实习` AS t2
    WHERE t2.`学部内实习指导教师` = t1.`教师名称`
), 0);

UPDATE `本科工作量教师排序表`
SET `指导教学实习周数` = `指导教学实习人数` * 6;

UPDATE `本科工作量教师排序表`
SET `指导教学实习P` = (`指导教学实习周数` * `指导教学实习人数` * 6) / 8;

UPDATE `本科工作量教师排序表`
SET `负责实习点建设与管理P` = `指导教学实习P`;


UPDATE `本科工作量教师排序表` AS t1
SET t1.`指导本科生竞赛P` = COALESCE((
    SELECT COUNT(*)
    FROM `学生竞赛` AS t2
    WHERE FIND_IN_SET(t1.`教师名称`, REPLACE(t2.`指导教师`, '、', ',')) > 0
), 0);

UPDATE `本科工作量教师排序表` AS t1
SET t1.`指导本科生科研P` = COALESCE((
    SELECT COUNT(*)
    FROM `学生科研` AS t2
    WHERE t1.`教师名称` = t2.`指导老师`
), 0);

UPDATE `本科工作量教师排序表` AS t1
SET t1.`本科生导师制` = COALESCE((
    SELECT COUNT(*)
    FROM `本科生导师制` AS t2
    WHERE t1.`教师名称` = t2.`导师姓名`
), 0);

UPDATE `本科工作量教师排序表` AS t1
LEFT JOIN `教研项目2` AS t2 ON t1.`教师名称` = t2.`教师姓名`
SET t1.`教研教改P` = COALESCE(t2.`教研项目工作量`, 0);



UPDATE `本科工作量教师排序表` AS t1
LEFT JOIN `一流课程2` AS t2 ON t1.`教师名称` = t2.`教师姓名`
SET t1.`一流课程` = COALESCE(t2.`工作量`, 0);

UPDATE `本科工作量教师排序表` AS t1
LEFT JOIN (
  SELECT `教师`, SUM(`教学成果工作量`) AS `教学成果奖工作量`
  FROM `教学成果奖2`
  GROUP BY `教师`
) AS t2 ON t1.`教师名称` = t2.`教师`
SET t1.`教学成果奖` = COALESCE(t2.`教学成果奖工作量`, 0);

UPDATE `本科工作量教师排序表` AS t1
SET t1.`公共服务` = COALESCE((
    SELECT SUM(`课时`)
    FROM `公共服务` AS t2
    WHERE t2.`姓名` = t1.`教师名称`
), 0);



END//
DELIMITER ;